MikroElektronika/core_packages/PIC/XC8/def/PIC18F66K40/mcu.h
extern volatile T1CKIPPSbits_t T1CKIPPSbits __at(0xDF5);
// bitfield macros
#define _T1CKIPPS_PIN_POSN                                  0x0
#define _T1CKIPPS_PIN_POSITION                              0x0
#define _T1CKIPPS_PIN_SIZE                                  0x3
#define _T1CKIPPS_PIN_LENGTH                                0x3
#define _T1CKIPPS_PIN_MASK                                  0x7
#define _T1CKIPPS_PORT_POSN                                 0x3
#define _T1CKIPPS_PORT_POSITION                             0x3
#define _T1CKIPPS_PORT_SIZE                                 0x2
#define _T1CKIPPS_PORT_LENGTH                               0x2
#define _T1CKIPPS_PORT_MASK                                 0x18
#define _T1CKIPPS_T1CKIPPS_POSN                             0x0
#define _T1CKIPPS_T1CKIPPS_POSITION                         0x0
#define _T1CKIPPS_T1CKIPPS_SIZE                             0x6
#define _T1CKIPPS_T1CKIPPS_LENGTH                           0x6
#define _T1CKIPPS_T1CKIPPS_MASK                             0x3F
#define _T1CKIPPS_T1CKIPPS0_POSN                            0x0
#define _T1CKIPPS_T1CKIPPS0_POSITION                        0x0
#define _T1CKIPPS_T1CKIPPS0_SIZE                            0x1
#define _T1CKIPPS_T1CKIPPS0_LENGTH                          0x1
#define _T1CKIPPS_T1CKIPPS0_MASK                            0x1
#define _T1CKIPPS_T1CKIPPS1_POSN                            0x1
#define _T1CKIPPS_T1CKIPPS1_POSITION                        0x1
#define _T1CKIPPS_T1CKIPPS1_SIZE                            0x1
#define _T1CKIPPS_T1CKIPPS1_LENGTH                          0x1
#define _T1CKIPPS_T1CKIPPS1_MASK                            0x2
#define _T1CKIPPS_T1CKIPPS2_POSN                            0x2
#define _T1CKIPPS_T1CKIPPS2_POSITION                        0x2
#define _T1CKIPPS_T1CKIPPS2_SIZE                            0x1
#define _T1CKIPPS_T1CKIPPS2_LENGTH                          0x1
#define _T1CKIPPS_T1CKIPPS2_MASK                            0x4
#define _T1CKIPPS_T1CKIPPS3_POSN                            0x3
#define _T1CKIPPS_T1CKIPPS3_POSITION                        0x3
#define _T1CKIPPS_T1CKIPPS3_SIZE                            0x1
#define _T1CKIPPS_T1CKIPPS3_LENGTH                          0x1
#define _T1CKIPPS_T1CKIPPS3_MASK                            0x8
#define _T1CKIPPS_T1CKIPPS4_POSN                            0x4
#define _T1CKIPPS_T1CKIPPS4_POSITION                        0x4
#define _T1CKIPPS_T1CKIPPS4_SIZE                            0x1
#define _T1CKIPPS_T1CKIPPS4_LENGTH                          0x1
#define _T1CKIPPS_T1CKIPPS4_MASK                            0x10

// Register: T1GPPS
#define T1GPPS T1GPPS
extern volatile unsigned char           T1GPPS              __at(0xDF6);
#ifndef _LIB_BUILD
asm("T1GPPS equ 0DF6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned T1GPPS                 :6;
    };
    struct {
        unsigned T1GPPS0                :1;
        unsigned T1GPPS1                :1;
        unsigned T1GPPS2                :1;
        unsigned T1GPPS3                :1;
        unsigned T1GPPS4                :1;
    };
} T1GPPSbits_t;
extern volatile T1GPPSbits_t T1GPPSbits __at(0xDF6);
// bitfield macros
#define _T1GPPS_PIN_POSN                                    0x0
#define _T1GPPS_PIN_POSITION                                0x0
#define _T1GPPS_PIN_SIZE                                    0x3
#define _T1GPPS_PIN_LENGTH                                  0x3
#define _T1GPPS_PIN_MASK                                    0x7
#define _T1GPPS_PORT_POSN                                   0x3
#define _T1GPPS_PORT_POSITION                               0x3
#define _T1GPPS_PORT_SIZE                                   0x2
#define _T1GPPS_PORT_LENGTH                                 0x2
#define _T1GPPS_PORT_MASK                                   0x18
#define _T1GPPS_T1GPPS_POSN                                 0x0
#define _T1GPPS_T1GPPS_POSITION                             0x0
#define _T1GPPS_T1GPPS_SIZE                                 0x6
#define _T1GPPS_T1GPPS_LENGTH                               0x6
#define _T1GPPS_T1GPPS_MASK                                 0x3F
#define _T1GPPS_T1GPPS0_POSN                                0x0
#define _T1GPPS_T1GPPS0_POSITION                            0x0
#define _T1GPPS_T1GPPS0_SIZE                                0x1
#define _T1GPPS_T1GPPS0_LENGTH                              0x1
#define _T1GPPS_T1GPPS0_MASK                                0x1
#define _T1GPPS_T1GPPS1_POSN                                0x1
#define _T1GPPS_T1GPPS1_POSITION                            0x1
#define _T1GPPS_T1GPPS1_SIZE                                0x1
#define _T1GPPS_T1GPPS1_LENGTH                              0x1
#define _T1GPPS_T1GPPS1_MASK                                0x2
#define _T1GPPS_T1GPPS2_POSN                                0x2
#define _T1GPPS_T1GPPS2_POSITION                            0x2
#define _T1GPPS_T1GPPS2_SIZE                                0x1
#define _T1GPPS_T1GPPS2_LENGTH                              0x1
#define _T1GPPS_T1GPPS2_MASK                                0x4
#define _T1GPPS_T1GPPS3_POSN                                0x3
#define _T1GPPS_T1GPPS3_POSITION                            0x3
#define _T1GPPS_T1GPPS3_SIZE                                0x1
#define _T1GPPS_T1GPPS3_LENGTH                              0x1
#define _T1GPPS_T1GPPS3_MASK                                0x8
#define _T1GPPS_T1GPPS4_POSN                                0x4
#define _T1GPPS_T1GPPS4_POSITION                            0x4
#define _T1GPPS_T1GPPS4_SIZE                                0x1
#define _T1GPPS_T1GPPS4_LENGTH                              0x1
#define _T1GPPS_T1GPPS4_MASK                                0x10

// Register: T3CKIPPS
#define T3CKIPPS T3CKIPPS
extern volatile unsigned char           T3CKIPPS            __at(0xDF7);
#ifndef _LIB_BUILD
asm("T3CKIPPS equ 0DF7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned T3CKIPPS               :6;
    };
    struct {
        unsigned T3CKIPPS0              :1;
        unsigned T3CKIPPS1              :1;
        unsigned T3CKIPPS2              :1;
        unsigned T3CKIPPS3              :1;
        unsigned T3CKIPPS4              :1;
    };
} T3CKIPPSbits_t;
extern volatile T3CKIPPSbits_t T3CKIPPSbits __at(0xDF7);
// bitfield macros
#define _T3CKIPPS_PIN_POSN                                  0x0
#define _T3CKIPPS_PIN_POSITION                              0x0
#define _T3CKIPPS_PIN_SIZE                                  0x3
#define _T3CKIPPS_PIN_LENGTH                                0x3
#define _T3CKIPPS_PIN_MASK                                  0x7
#define _T3CKIPPS_PORT_POSN                                 0x3
#define _T3CKIPPS_PORT_POSITION                             0x3
#define _T3CKIPPS_PORT_SIZE                                 0x2
#define _T3CKIPPS_PORT_LENGTH                               0x2
#define _T3CKIPPS_PORT_MASK                                 0x18
#define _T3CKIPPS_T3CKIPPS_POSN                             0x0
#define _T3CKIPPS_T3CKIPPS_POSITION                         0x0
#define _T3CKIPPS_T3CKIPPS_SIZE                             0x6
#define _T3CKIPPS_T3CKIPPS_LENGTH                           0x6
#define _T3CKIPPS_T3CKIPPS_MASK                             0x3F
#define _T3CKIPPS_T3CKIPPS0_POSN                            0x0
#define _T3CKIPPS_T3CKIPPS0_POSITION                        0x0
#define _T3CKIPPS_T3CKIPPS0_SIZE                            0x1
#define _T3CKIPPS_T3CKIPPS0_LENGTH                          0x1
#define _T3CKIPPS_T3CKIPPS0_MASK                            0x1
#define _T3CKIPPS_T3CKIPPS1_POSN                            0x1
#define _T3CKIPPS_T3CKIPPS1_POSITION                        0x1
#define _T3CKIPPS_T3CKIPPS1_SIZE                            0x1
#define _T3CKIPPS_T3CKIPPS1_LENGTH                          0x1
#define _T3CKIPPS_T3CKIPPS1_MASK                            0x2
#define _T3CKIPPS_T3CKIPPS2_POSN                            0x2
#define _T3CKIPPS_T3CKIPPS2_POSITION                        0x2
#define _T3CKIPPS_T3CKIPPS2_SIZE                            0x1
#define _T3CKIPPS_T3CKIPPS2_LENGTH                          0x1
#define _T3CKIPPS_T3CKIPPS2_MASK                            0x4
#define _T3CKIPPS_T3CKIPPS3_POSN                            0x3
#define _T3CKIPPS_T3CKIPPS3_POSITION                        0x3
#define _T3CKIPPS_T3CKIPPS3_SIZE                            0x1
#define _T3CKIPPS_T3CKIPPS3_LENGTH                          0x1
#define _T3CKIPPS_T3CKIPPS3_MASK                            0x8
#define _T3CKIPPS_T3CKIPPS4_POSN                            0x4
#define _T3CKIPPS_T3CKIPPS4_POSITION                        0x4
#define _T3CKIPPS_T3CKIPPS4_SIZE                            0x1
#define _T3CKIPPS_T3CKIPPS4_LENGTH                          0x1
#define _T3CKIPPS_T3CKIPPS4_MASK                            0x10

// Register: T3GPPS
#define T3GPPS T3GPPS
extern volatile unsigned char           T3GPPS              __at(0xDF8);
#ifndef _LIB_BUILD
asm("T3GPPS equ 0DF8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned T3GPPS                 :6;
    };
    struct {
        unsigned T3GPPS0                :1;
        unsigned T3GPPS1                :1;
        unsigned T3GPPS2                :1;
        unsigned T3GPPS3                :1;
        unsigned T3GPPS4                :1;
    };
} T3GPPSbits_t;
extern volatile T3GPPSbits_t T3GPPSbits __at(0xDF8);
// bitfield macros
#define _T3GPPS_PIN_POSN                                    0x0
#define _T3GPPS_PIN_POSITION                                0x0
#define _T3GPPS_PIN_SIZE                                    0x3
#define _T3GPPS_PIN_LENGTH                                  0x3
#define _T3GPPS_PIN_MASK                                    0x7
#define _T3GPPS_PORT_POSN                                   0x3
#define _T3GPPS_PORT_POSITION                               0x3
#define _T3GPPS_PORT_SIZE                                   0x2
#define _T3GPPS_PORT_LENGTH                                 0x2
#define _T3GPPS_PORT_MASK                                   0x18
#define _T3GPPS_T3GPPS_POSN                                 0x0
#define _T3GPPS_T3GPPS_POSITION                             0x0
#define _T3GPPS_T3GPPS_SIZE                                 0x6
#define _T3GPPS_T3GPPS_LENGTH                               0x6
#define _T3GPPS_T3GPPS_MASK                                 0x3F
#define _T3GPPS_T3GPPS0_POSN                                0x0
#define _T3GPPS_T3GPPS0_POSITION                            0x0
#define _T3GPPS_T3GPPS0_SIZE                                0x1
#define _T3GPPS_T3GPPS0_LENGTH                              0x1
#define _T3GPPS_T3GPPS0_MASK                                0x1
#define _T3GPPS_T3GPPS1_POSN                                0x1
#define _T3GPPS_T3GPPS1_POSITION                            0x1
#define _T3GPPS_T3GPPS1_SIZE                                0x1
#define _T3GPPS_T3GPPS1_LENGTH                              0x1
#define _T3GPPS_T3GPPS1_MASK                                0x2
#define _T3GPPS_T3GPPS2_POSN                                0x2
#define _T3GPPS_T3GPPS2_POSITION                            0x2
#define _T3GPPS_T3GPPS2_SIZE                                0x1
#define _T3GPPS_T3GPPS2_LENGTH                              0x1
#define _T3GPPS_T3GPPS2_MASK                                0x4
#define _T3GPPS_T3GPPS3_POSN                                0x3
#define _T3GPPS_T3GPPS3_POSITION                            0x3
#define _T3GPPS_T3GPPS3_SIZE                                0x1
#define _T3GPPS_T3GPPS3_LENGTH                              0x1
#define _T3GPPS_T3GPPS3_MASK                                0x8
#define _T3GPPS_T3GPPS4_POSN                                0x4
#define _T3GPPS_T3GPPS4_POSITION                            0x4
#define _T3GPPS_T3GPPS4_SIZE                                0x1
#define _T3GPPS_T3GPPS4_LENGTH                              0x1
#define _T3GPPS_T3GPPS4_MASK                                0x10

// Register: T5CKIPPS
#define T5CKIPPS T5CKIPPS
extern volatile unsigned char           T5CKIPPS            __at(0xDF9);
#ifndef _LIB_BUILD
asm("T5CKIPPS equ 0DF9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned T5CKIPPS               :6;
    };
    struct {
        unsigned T5CKIPPS0              :1;
        unsigned T5CKIPPS1              :1;
        unsigned T5CKIPPS2              :1;
        unsigned T5CKIPPS3              :1;
        unsigned T5CKIPPS4              :1;
        unsigned T5CKIPPS5              :1;
    };
} T5CKIPPSbits_t;
extern volatile T5CKIPPSbits_t T5CKIPPSbits __at(0xDF9);
// bitfield macros
#define _T5CKIPPS_PIN_POSN                                  0x0
#define _T5CKIPPS_PIN_POSITION                              0x0
#define _T5CKIPPS_PIN_SIZE                                  0x3
#define _T5CKIPPS_PIN_LENGTH                                0x3
#define _T5CKIPPS_PIN_MASK                                  0x7
#define _T5CKIPPS_PORT_POSN                                 0x3
#define _T5CKIPPS_PORT_POSITION                             0x3
#define _T5CKIPPS_PORT_SIZE                                 0x3
#define _T5CKIPPS_PORT_LENGTH                               0x3
#define _T5CKIPPS_PORT_MASK                                 0x38
#define _T5CKIPPS_T5CKIPPS_POSN                             0x0
#define _T5CKIPPS_T5CKIPPS_POSITION                         0x0
#define _T5CKIPPS_T5CKIPPS_SIZE                             0x6
#define _T5CKIPPS_T5CKIPPS_LENGTH                           0x6
#define _T5CKIPPS_T5CKIPPS_MASK                             0x3F
#define _T5CKIPPS_T5CKIPPS0_POSN                            0x0
#define _T5CKIPPS_T5CKIPPS0_POSITION                        0x0
#define _T5CKIPPS_T5CKIPPS0_SIZE                            0x1
#define _T5CKIPPS_T5CKIPPS0_LENGTH                          0x1
#define _T5CKIPPS_T5CKIPPS0_MASK                            0x1
#define _T5CKIPPS_T5CKIPPS1_POSN                            0x1
#define _T5CKIPPS_T5CKIPPS1_POSITION                        0x1
#define _T5CKIPPS_T5CKIPPS1_SIZE                            0x1
#define _T5CKIPPS_T5CKIPPS1_LENGTH                          0x1
#define _T5CKIPPS_T5CKIPPS1_MASK                            0x2
#define _T5CKIPPS_T5CKIPPS2_POSN                            0x2
#define _T5CKIPPS_T5CKIPPS2_POSITION                        0x2
#define _T5CKIPPS_T5CKIPPS2_SIZE                            0x1
#define _T5CKIPPS_T5CKIPPS2_LENGTH                          0x1
#define _T5CKIPPS_T5CKIPPS2_MASK                            0x4
#define _T5CKIPPS_T5CKIPPS3_POSN                            0x3
#define _T5CKIPPS_T5CKIPPS3_POSITION                        0x3
#define _T5CKIPPS_T5CKIPPS3_SIZE                            0x1
#define _T5CKIPPS_T5CKIPPS3_LENGTH                          0x1
#define _T5CKIPPS_T5CKIPPS3_MASK                            0x8
#define _T5CKIPPS_T5CKIPPS4_POSN                            0x4
#define _T5CKIPPS_T5CKIPPS4_POSITION                        0x4
#define _T5CKIPPS_T5CKIPPS4_SIZE                            0x1
#define _T5CKIPPS_T5CKIPPS4_LENGTH                          0x1
#define _T5CKIPPS_T5CKIPPS4_MASK                            0x10
#define _T5CKIPPS_T5CKIPPS5_POSN                            0x5
#define _T5CKIPPS_T5CKIPPS5_POSITION                        0x5
#define _T5CKIPPS_T5CKIPPS5_SIZE                            0x1
#define _T5CKIPPS_T5CKIPPS5_LENGTH                          0x1
#define _T5CKIPPS_T5CKIPPS5_MASK                            0x20

// Register: T5GPPS
#define T5GPPS T5GPPS
extern volatile unsigned char           T5GPPS              __at(0xDFA);
#ifndef _LIB_BUILD
asm("T5GPPS equ 0DFAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned T5GPPS                 :6;
    };
    struct {
        unsigned T5GPPS0                :1;
        unsigned T5GPPS1                :1;
        unsigned T5GPPS2                :1;
        unsigned T5GPPS3                :1;
        unsigned T5GPPS4                :1;
        unsigned T5GPPS5                :1;
    };
} T5GPPSbits_t;
extern volatile T5GPPSbits_t T5GPPSbits __at(0xDFA);
// bitfield macros
#define _T5GPPS_PIN_POSN                                    0x0
#define _T5GPPS_PIN_POSITION                                0x0
#define _T5GPPS_PIN_SIZE                                    0x3
#define _T5GPPS_PIN_LENGTH                                  0x3
#define _T5GPPS_PIN_MASK                                    0x7
#define _T5GPPS_PORT_POSN                                   0x3
#define _T5GPPS_PORT_POSITION                               0x3
#define _T5GPPS_PORT_SIZE                                   0x3
#define _T5GPPS_PORT_LENGTH                                 0x3
#define _T5GPPS_PORT_MASK                                   0x38
#define _T5GPPS_T5GPPS_POSN                                 0x0
#define _T5GPPS_T5GPPS_POSITION                             0x0
#define _T5GPPS_T5GPPS_SIZE                                 0x6
#define _T5GPPS_T5GPPS_LENGTH                               0x6
#define _T5GPPS_T5GPPS_MASK                                 0x3F
#define _T5GPPS_T5GPPS0_POSN                                0x0
#define _T5GPPS_T5GPPS0_POSITION                            0x0
#define _T5GPPS_T5GPPS0_SIZE                                0x1
#define _T5GPPS_T5GPPS0_LENGTH                              0x1
#define _T5GPPS_T5GPPS0_MASK                                0x1
#define _T5GPPS_T5GPPS1_POSN                                0x1
#define _T5GPPS_T5GPPS1_POSITION                            0x1
#define _T5GPPS_T5GPPS1_SIZE                                0x1
#define _T5GPPS_T5GPPS1_LENGTH                              0x1
#define _T5GPPS_T5GPPS1_MASK                                0x2
#define _T5GPPS_T5GPPS2_POSN                                0x2
#define _T5GPPS_T5GPPS2_POSITION                            0x2
#define _T5GPPS_T5GPPS2_SIZE                                0x1
#define _T5GPPS_T5GPPS2_LENGTH                              0x1
#define _T5GPPS_T5GPPS2_MASK                                0x4
#define _T5GPPS_T5GPPS3_POSN                                0x3
#define _T5GPPS_T5GPPS3_POSITION                            0x3
#define _T5GPPS_T5GPPS3_SIZE                                0x1
#define _T5GPPS_T5GPPS3_LENGTH                              0x1
#define _T5GPPS_T5GPPS3_MASK                                0x8
#define _T5GPPS_T5GPPS4_POSN                                0x4
#define _T5GPPS_T5GPPS4_POSITION                            0x4
#define _T5GPPS_T5GPPS4_SIZE                                0x1
#define _T5GPPS_T5GPPS4_LENGTH                              0x1
#define _T5GPPS_T5GPPS4_MASK                                0x10
#define _T5GPPS_T5GPPS5_POSN                                0x5
#define _T5GPPS_T5GPPS5_POSITION                            0x5
#define _T5GPPS_T5GPPS5_SIZE                                0x1
#define _T5GPPS_T5GPPS5_LENGTH                              0x1
#define _T5GPPS_T5GPPS5_MASK                                0x20

// Register: T7CKIPPS
#define T7CKIPPS T7CKIPPS
extern volatile unsigned char           T7CKIPPS            __at(0xDFB);
#ifndef _LIB_BUILD
asm("T7CKIPPS equ 0DFBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned T7CKIPPS               :6;
    };
    struct {
        unsigned T7CKIPPS0              :1;
        unsigned T7CKIPPS1              :1;
        unsigned T7CKIPPS2              :1;
        unsigned T7CKIPPS3              :1;
        unsigned T7CKIPPS4              :1;
        unsigned T7CKIPPS5              :1;
    };
} T7CKIPPSbits_t;
extern volatile T7CKIPPSbits_t T7CKIPPSbits __at(0xDFB);
// bitfield macros
#define _T7CKIPPS_PIN_POSN                                  0x0
#define _T7CKIPPS_PIN_POSITION                              0x0
#define _T7CKIPPS_PIN_SIZE                                  0x3
#define _T7CKIPPS_PIN_LENGTH                                0x3
#define _T7CKIPPS_PIN_MASK                                  0x7
#define _T7CKIPPS_PORT_POSN                                 0x3
#define _T7CKIPPS_PORT_POSITION                             0x3
#define _T7CKIPPS_PORT_SIZE                                 0x3
#define _T7CKIPPS_PORT_LENGTH                               0x3
#define _T7CKIPPS_PORT_MASK                                 0x38
#define _T7CKIPPS_T7CKIPPS_POSN                             0x0
#define _T7CKIPPS_T7CKIPPS_POSITION                         0x0
#define _T7CKIPPS_T7CKIPPS_SIZE                             0x6
#define _T7CKIPPS_T7CKIPPS_LENGTH                           0x6
#define _T7CKIPPS_T7CKIPPS_MASK                             0x3F
#define _T7CKIPPS_T7CKIPPS0_POSN                            0x0
#define _T7CKIPPS_T7CKIPPS0_POSITION                        0x0
#define _T7CKIPPS_T7CKIPPS0_SIZE                            0x1
#define _T7CKIPPS_T7CKIPPS0_LENGTH                          0x1
#define _T7CKIPPS_T7CKIPPS0_MASK                            0x1
#define _T7CKIPPS_T7CKIPPS1_POSN                            0x1
#define _T7CKIPPS_T7CKIPPS1_POSITION                        0x1
#define _T7CKIPPS_T7CKIPPS1_SIZE                            0x1
#define _T7CKIPPS_T7CKIPPS1_LENGTH                          0x1
#define _T7CKIPPS_T7CKIPPS1_MASK                            0x2
#define _T7CKIPPS_T7CKIPPS2_POSN                            0x2
#define _T7CKIPPS_T7CKIPPS2_POSITION                        0x2
#define _T7CKIPPS_T7CKIPPS2_SIZE                            0x1
#define _T7CKIPPS_T7CKIPPS2_LENGTH                          0x1
#define _T7CKIPPS_T7CKIPPS2_MASK                            0x4
#define _T7CKIPPS_T7CKIPPS3_POSN                            0x3
#define _T7CKIPPS_T7CKIPPS3_POSITION                        0x3
#define _T7CKIPPS_T7CKIPPS3_SIZE                            0x1
#define _T7CKIPPS_T7CKIPPS3_LENGTH                          0x1
#define _T7CKIPPS_T7CKIPPS3_MASK                            0x8
#define _T7CKIPPS_T7CKIPPS4_POSN                            0x4
#define _T7CKIPPS_T7CKIPPS4_POSITION                        0x4
#define _T7CKIPPS_T7CKIPPS4_SIZE                            0x1
#define _T7CKIPPS_T7CKIPPS4_LENGTH                          0x1
#define _T7CKIPPS_T7CKIPPS4_MASK                            0x10
#define _T7CKIPPS_T7CKIPPS5_POSN                            0x5
#define _T7CKIPPS_T7CKIPPS5_POSITION                        0x5
#define _T7CKIPPS_T7CKIPPS5_SIZE                            0x1
#define _T7CKIPPS_T7CKIPPS5_LENGTH                          0x1
#define _T7CKIPPS_T7CKIPPS5_MASK                            0x20

