MikroElektronika/core_packages/PIC/XC8/def/PIC18F66K40/mcu.h
extern volatile CCP5PPSbits_t CCP5PPSbits __at(0xE06);
// bitfield macros
#define _CCP5PPS_PIN_POSN                                   0x0
#define _CCP5PPS_PIN_POSITION                               0x0
#define _CCP5PPS_PIN_SIZE                                   0x3
#define _CCP5PPS_PIN_LENGTH                                 0x3
#define _CCP5PPS_PIN_MASK                                   0x7
#define _CCP5PPS_PORT_POSN                                  0x3
#define _CCP5PPS_PORT_POSITION                              0x3
#define _CCP5PPS_PORT_SIZE                                  0x3
#define _CCP5PPS_PORT_LENGTH                                0x3
#define _CCP5PPS_PORT_MASK                                  0x38
#define _CCP5PPS_CCP5PPS_POSN                               0x0
#define _CCP5PPS_CCP5PPS_POSITION                           0x0
#define _CCP5PPS_CCP5PPS_SIZE                               0x6
#define _CCP5PPS_CCP5PPS_LENGTH                             0x6
#define _CCP5PPS_CCP5PPS_MASK                               0x3F
#define _CCP5PPS_CCP5PPS0_POSN                              0x0
#define _CCP5PPS_CCP5PPS0_POSITION                          0x0
#define _CCP5PPS_CCP5PPS0_SIZE                              0x1
#define _CCP5PPS_CCP5PPS0_LENGTH                            0x1
#define _CCP5PPS_CCP5PPS0_MASK                              0x1
#define _CCP5PPS_CCP5PPS1_POSN                              0x1
#define _CCP5PPS_CCP5PPS1_POSITION                          0x1
#define _CCP5PPS_CCP5PPS1_SIZE                              0x1
#define _CCP5PPS_CCP5PPS1_LENGTH                            0x1
#define _CCP5PPS_CCP5PPS1_MASK                              0x2
#define _CCP5PPS_CCP5PPS2_POSN                              0x2
#define _CCP5PPS_CCP5PPS2_POSITION                          0x2
#define _CCP5PPS_CCP5PPS2_SIZE                              0x1
#define _CCP5PPS_CCP5PPS2_LENGTH                            0x1
#define _CCP5PPS_CCP5PPS2_MASK                              0x4
#define _CCP5PPS_CCP5PPS3_POSN                              0x3
#define _CCP5PPS_CCP5PPS3_POSITION                          0x3
#define _CCP5PPS_CCP5PPS3_SIZE                              0x1
#define _CCP5PPS_CCP5PPS3_LENGTH                            0x1
#define _CCP5PPS_CCP5PPS3_MASK                              0x8
#define _CCP5PPS_CCP5PPS4_POSN                              0x4
#define _CCP5PPS_CCP5PPS4_POSITION                          0x4
#define _CCP5PPS_CCP5PPS4_SIZE                              0x1
#define _CCP5PPS_CCP5PPS4_LENGTH                            0x1
#define _CCP5PPS_CCP5PPS4_MASK                              0x10
#define _CCP5PPS_CCP5PPS5_POSN                              0x5
#define _CCP5PPS_CCP5PPS5_POSITION                          0x5
#define _CCP5PPS_CCP5PPS5_SIZE                              0x1
#define _CCP5PPS_CCP5PPS5_LENGTH                            0x1
#define _CCP5PPS_CCP5PPS5_MASK                              0x20

// Register: SMT1WINPPS
#define SMT1WINPPS SMT1WINPPS
extern volatile unsigned char           SMT1WINPPS          __at(0xE07);
#ifndef _LIB_BUILD
asm("SMT1WINPPS equ 0E07h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned SMT1WINPPS             :6;
    };
    struct {
        unsigned SMT1WINPPS0            :1;
        unsigned SMT1WINPPS1            :1;
        unsigned SMT1WINPPS2            :1;
        unsigned SMT1WINPPS3            :1;
        unsigned SMT1WINPPS4            :1;
        unsigned SMT1WINPPS5            :1;
    };
} SMT1WINPPSbits_t;
extern volatile SMT1WINPPSbits_t SMT1WINPPSbits __at(0xE07);
// bitfield macros
#define _SMT1WINPPS_PIN_POSN                                0x0
#define _SMT1WINPPS_PIN_POSITION                            0x0
#define _SMT1WINPPS_PIN_SIZE                                0x3
#define _SMT1WINPPS_PIN_LENGTH                              0x3
#define _SMT1WINPPS_PIN_MASK                                0x7
#define _SMT1WINPPS_PORT_POSN                               0x3
#define _SMT1WINPPS_PORT_POSITION                           0x3
#define _SMT1WINPPS_PORT_SIZE                               0x3
#define _SMT1WINPPS_PORT_LENGTH                             0x3
#define _SMT1WINPPS_PORT_MASK                               0x38
#define _SMT1WINPPS_SMT1WINPPS_POSN                         0x0
#define _SMT1WINPPS_SMT1WINPPS_POSITION                     0x0
#define _SMT1WINPPS_SMT1WINPPS_SIZE                         0x6
#define _SMT1WINPPS_SMT1WINPPS_LENGTH                       0x6
#define _SMT1WINPPS_SMT1WINPPS_MASK                         0x3F
#define _SMT1WINPPS_SMT1WINPPS0_POSN                        0x0
#define _SMT1WINPPS_SMT1WINPPS0_POSITION                    0x0
#define _SMT1WINPPS_SMT1WINPPS0_SIZE                        0x1
#define _SMT1WINPPS_SMT1WINPPS0_LENGTH                      0x1
#define _SMT1WINPPS_SMT1WINPPS0_MASK                        0x1
#define _SMT1WINPPS_SMT1WINPPS1_POSN                        0x1
#define _SMT1WINPPS_SMT1WINPPS1_POSITION                    0x1
#define _SMT1WINPPS_SMT1WINPPS1_SIZE                        0x1
#define _SMT1WINPPS_SMT1WINPPS1_LENGTH                      0x1
#define _SMT1WINPPS_SMT1WINPPS1_MASK                        0x2
#define _SMT1WINPPS_SMT1WINPPS2_POSN                        0x2
#define _SMT1WINPPS_SMT1WINPPS2_POSITION                    0x2
#define _SMT1WINPPS_SMT1WINPPS2_SIZE                        0x1
#define _SMT1WINPPS_SMT1WINPPS2_LENGTH                      0x1
#define _SMT1WINPPS_SMT1WINPPS2_MASK                        0x4
#define _SMT1WINPPS_SMT1WINPPS3_POSN                        0x3
#define _SMT1WINPPS_SMT1WINPPS3_POSITION                    0x3
#define _SMT1WINPPS_SMT1WINPPS3_SIZE                        0x1
#define _SMT1WINPPS_SMT1WINPPS3_LENGTH                      0x1
#define _SMT1WINPPS_SMT1WINPPS3_MASK                        0x8
#define _SMT1WINPPS_SMT1WINPPS4_POSN                        0x4
#define _SMT1WINPPS_SMT1WINPPS4_POSITION                    0x4
#define _SMT1WINPPS_SMT1WINPPS4_SIZE                        0x1
#define _SMT1WINPPS_SMT1WINPPS4_LENGTH                      0x1
#define _SMT1WINPPS_SMT1WINPPS4_MASK                        0x10
#define _SMT1WINPPS_SMT1WINPPS5_POSN                        0x5
#define _SMT1WINPPS_SMT1WINPPS5_POSITION                    0x5
#define _SMT1WINPPS_SMT1WINPPS5_SIZE                        0x1
#define _SMT1WINPPS_SMT1WINPPS5_LENGTH                      0x1
#define _SMT1WINPPS_SMT1WINPPS5_MASK                        0x20

// Register: SMT1SIGPPS
#define SMT1SIGPPS SMT1SIGPPS
extern volatile unsigned char           SMT1SIGPPS          __at(0xE08);
#ifndef _LIB_BUILD
asm("SMT1SIGPPS equ 0E08h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned SMT1SIGPPS             :6;
    };
    struct {
        unsigned SMT1SIGPPS0            :1;
        unsigned SMT1SIGPPS1            :1;
        unsigned SMT1SIGPPS2            :1;
        unsigned SMT1SIGPPS3            :1;
        unsigned SMT1SIGPPS4            :1;
        unsigned SMT1SIGPPS5            :1;
    };
} SMT1SIGPPSbits_t;
