MikroElektronika/core_packages/PIC/XC8/def/PIC18F66K40/mcu.h
// Register: PIE4
#define PIE4 PIE4
extern volatile unsigned char           PIE4                __at(0xE2D);
#ifndef _LIB_BUILD
asm("PIE4 equ 0E2Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TX3IE                  :1;
        unsigned RC3IE                  :1;
        unsigned TX4IE                  :1;
        unsigned RC4IE                  :1;
        unsigned TX5IE                  :1;
        unsigned RC5IE                  :1;
    };
} PIE4bits_t;
extern volatile PIE4bits_t PIE4bits __at(0xE2D);
// bitfield macros
#define _PIE4_TX3IE_POSN                                    0x0
#define _PIE4_TX3IE_POSITION                                0x0
#define _PIE4_TX3IE_SIZE                                    0x1
#define _PIE4_TX3IE_LENGTH                                  0x1
#define _PIE4_TX3IE_MASK                                    0x1
#define _PIE4_RC3IE_POSN                                    0x1
#define _PIE4_RC3IE_POSITION                                0x1
#define _PIE4_RC3IE_SIZE                                    0x1
#define _PIE4_RC3IE_LENGTH                                  0x1
#define _PIE4_RC3IE_MASK                                    0x2
#define _PIE4_TX4IE_POSN                                    0x2
#define _PIE4_TX4IE_POSITION                                0x2
#define _PIE4_TX4IE_SIZE                                    0x1
#define _PIE4_TX4IE_LENGTH                                  0x1
#define _PIE4_TX4IE_MASK                                    0x4
#define _PIE4_RC4IE_POSN                                    0x3
#define _PIE4_RC4IE_POSITION                                0x3
#define _PIE4_RC4IE_SIZE                                    0x1
#define _PIE4_RC4IE_LENGTH                                  0x1
#define _PIE4_RC4IE_MASK                                    0x8
#define _PIE4_TX5IE_POSN                                    0x4
#define _PIE4_TX5IE_POSITION                                0x4
#define _PIE4_TX5IE_SIZE                                    0x1
#define _PIE4_TX5IE_LENGTH                                  0x1
#define _PIE4_TX5IE_MASK                                    0x10
#define _PIE4_RC5IE_POSN                                    0x5
#define _PIE4_RC5IE_POSITION                                0x5
#define _PIE4_RC5IE_SIZE                                    0x1
#define _PIE4_RC5IE_LENGTH                                  0x1
#define _PIE4_RC5IE_MASK                                    0x20

// Register: PIE5
#define PIE5 PIE5
extern volatile unsigned char           PIE5                __at(0xE2E);
#ifndef _LIB_BUILD
asm("PIE5 equ 0E2Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1IE                 :1;
        unsigned TMR2IE                 :1;
        unsigned TMR3IE                 :1;
        unsigned TMR4IE                 :1;
        unsigned TMR5IE                 :1;
        unsigned TMR6IE                 :1;
        unsigned TMR7IE                 :1;
        unsigned TMR8IE                 :1;
    };
} PIE5bits_t;
extern volatile PIE5bits_t PIE5bits __at(0xE2E);
// bitfield macros
#define _PIE5_TMR1IE_POSN                                   0x0
#define _PIE5_TMR1IE_POSITION                               0x0
#define _PIE5_TMR1IE_SIZE                                   0x1
#define _PIE5_TMR1IE_LENGTH                                 0x1
#define _PIE5_TMR1IE_MASK                                   0x1
#define _PIE5_TMR2IE_POSN                                   0x1
#define _PIE5_TMR2IE_POSITION                               0x1
#define _PIE5_TMR2IE_SIZE                                   0x1
#define _PIE5_TMR2IE_LENGTH                                 0x1
#define _PIE5_TMR2IE_MASK                                   0x2
#define _PIE5_TMR3IE_POSN                                   0x2
#define _PIE5_TMR3IE_POSITION                               0x2
#define _PIE5_TMR3IE_SIZE                                   0x1
#define _PIE5_TMR3IE_LENGTH                                 0x1
#define _PIE5_TMR3IE_MASK                                   0x4
#define _PIE5_TMR4IE_POSN                                   0x3
#define _PIE5_TMR4IE_POSITION                               0x3
#define _PIE5_TMR4IE_SIZE                                   0x1
#define _PIE5_TMR4IE_LENGTH                                 0x1
#define _PIE5_TMR4IE_MASK                                   0x8
#define _PIE5_TMR5IE_POSN                                   0x4
#define _PIE5_TMR5IE_POSITION                               0x4
#define _PIE5_TMR5IE_SIZE                                   0x1
#define _PIE5_TMR5IE_LENGTH                                 0x1
#define _PIE5_TMR5IE_MASK                                   0x10
#define _PIE5_TMR6IE_POSN                                   0x5
#define _PIE5_TMR6IE_POSITION                               0x5
#define _PIE5_TMR6IE_SIZE                                   0x1
#define _PIE5_TMR6IE_LENGTH                                 0x1
#define _PIE5_TMR6IE_MASK                                   0x20
#define _PIE5_TMR7IE_POSN                                   0x6
#define _PIE5_TMR7IE_POSITION                               0x6
#define _PIE5_TMR7IE_SIZE                                   0x1
#define _PIE5_TMR7IE_LENGTH                                 0x1
#define _PIE5_TMR7IE_MASK                                   0x40
#define _PIE5_TMR8IE_POSN                                   0x7
#define _PIE5_TMR8IE_POSITION                               0x7
#define _PIE5_TMR8IE_SIZE                                   0x1
#define _PIE5_TMR8IE_LENGTH                                 0x1
#define _PIE5_TMR8IE_MASK                                   0x80

// Register: PIE6
#define PIE6 PIE6
extern volatile unsigned char           PIE6                __at(0xE2F);
#ifndef _LIB_BUILD
asm("PIE6 equ 0E2Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1GIE                :1;
        unsigned TMR3GIE                :1;
        unsigned TMR5GIE                :1;
        unsigned TMR7GIE                :1;
    };
} PIE6bits_t;
extern volatile PIE6bits_t PIE6bits __at(0xE2F);
// bitfield macros
#define _PIE6_TMR1GIE_POSN                                  0x0
#define _PIE6_TMR1GIE_POSITION                              0x0
#define _PIE6_TMR1GIE_SIZE                                  0x1
#define _PIE6_TMR1GIE_LENGTH                                0x1
#define _PIE6_TMR1GIE_MASK                                  0x1
#define _PIE6_TMR3GIE_POSN                                  0x1
#define _PIE6_TMR3GIE_POSITION                              0x1
#define _PIE6_TMR3GIE_SIZE                                  0x1
#define _PIE6_TMR3GIE_LENGTH                                0x1
#define _PIE6_TMR3GIE_MASK                                  0x2
#define _PIE6_TMR5GIE_POSN                                  0x2
#define _PIE6_TMR5GIE_POSITION                              0x2
#define _PIE6_TMR5GIE_SIZE                                  0x1
#define _PIE6_TMR5GIE_LENGTH                                0x1
#define _PIE6_TMR5GIE_MASK                                  0x4
#define _PIE6_TMR7GIE_POSN                                  0x3
#define _PIE6_TMR7GIE_POSITION                              0x3
#define _PIE6_TMR7GIE_SIZE                                  0x1
#define _PIE6_TMR7GIE_LENGTH                                0x1
#define _PIE6_TMR7GIE_MASK                                  0x8

// Register: PIE7
#define PIE7 PIE7
extern volatile unsigned char           PIE7                __at(0xE30);
#ifndef _LIB_BUILD
asm("PIE7 equ 0E30h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP1IE                 :1;
        unsigned CCP2IE                 :1;
        unsigned CCP3IE                 :1;
        unsigned CCP4IE                 :1;
        unsigned CCP5IE                 :1;
    };
} PIE7bits_t;
