MikroElektronika/core_packages/PIC/XC8/def/PIC18F66K40/mcu.h
// Register: PMD2
#define PMD2 PMD2
extern volatile unsigned char           PMD2                __at(0xE4E);
#ifndef _LIB_BUILD
asm("PMD2 equ 0E4Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR8MD                 :1;
        unsigned SMU1MD                 :1;
        unsigned SMU2MD                 :1;
        unsigned DSMMD                  :1;
        unsigned                        :1;
        unsigned CWGMD                  :1;
    };
    struct {
        unsigned                        :5;
        unsigned CWG1MD                 :1;
    };
} PMD2bits_t;
extern volatile PMD2bits_t PMD2bits __at(0xE4E);
// bitfield macros
#define _PMD2_TMR8MD_POSN                                   0x0
#define _PMD2_TMR8MD_POSITION                               0x0
#define _PMD2_TMR8MD_SIZE                                   0x1
#define _PMD2_TMR8MD_LENGTH                                 0x1
#define _PMD2_TMR8MD_MASK                                   0x1
#define _PMD2_SMU1MD_POSN                                   0x1
#define _PMD2_SMU1MD_POSITION                               0x1
#define _PMD2_SMU1MD_SIZE                                   0x1
#define _PMD2_SMU1MD_LENGTH                                 0x1
#define _PMD2_SMU1MD_MASK                                   0x2
#define _PMD2_SMU2MD_POSN                                   0x2
#define _PMD2_SMU2MD_POSITION                               0x2
#define _PMD2_SMU2MD_SIZE                                   0x1
#define _PMD2_SMU2MD_LENGTH                                 0x1
#define _PMD2_SMU2MD_MASK                                   0x4
#define _PMD2_DSMMD_POSN                                    0x3
#define _PMD2_DSMMD_POSITION                                0x3
#define _PMD2_DSMMD_SIZE                                    0x1
#define _PMD2_DSMMD_LENGTH                                  0x1
#define _PMD2_DSMMD_MASK                                    0x8
#define _PMD2_CWGMD_POSN                                    0x5
#define _PMD2_CWGMD_POSITION                                0x5
#define _PMD2_CWGMD_SIZE                                    0x1
#define _PMD2_CWGMD_LENGTH                                  0x1
#define _PMD2_CWGMD_MASK                                    0x20
#define _PMD2_CWG1MD_POSN                                   0x5
#define _PMD2_CWG1MD_POSITION                               0x5
#define _PMD2_CWG1MD_SIZE                                   0x1
#define _PMD2_CWG1MD_LENGTH                                 0x1
#define _PMD2_CWG1MD_MASK                                   0x20

// Register: PMD3
#define PMD3 PMD3
extern volatile unsigned char           PMD3                __at(0xE4F);
#ifndef _LIB_BUILD
asm("PMD3 equ 0E4Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ZCDMD                  :1;
        unsigned CMP1MD                 :1;
        unsigned CMP2MD                 :1;
        unsigned CMP3MD                 :1;
        unsigned                        :1;
        unsigned ADCMD                  :1;
        unsigned DACMD                  :1;
    };
} PMD3bits_t;
extern volatile PMD3bits_t PMD3bits __at(0xE4F);
// bitfield macros
#define _PMD3_ZCDMD_POSN                                    0x0
#define _PMD3_ZCDMD_POSITION                                0x0
#define _PMD3_ZCDMD_SIZE                                    0x1
#define _PMD3_ZCDMD_LENGTH                                  0x1
#define _PMD3_ZCDMD_MASK                                    0x1
#define _PMD3_CMP1MD_POSN                                   0x1
#define _PMD3_CMP1MD_POSITION                               0x1
#define _PMD3_CMP1MD_SIZE                                   0x1
#define _PMD3_CMP1MD_LENGTH                                 0x1
#define _PMD3_CMP1MD_MASK                                   0x2
#define _PMD3_CMP2MD_POSN                                   0x2
#define _PMD3_CMP2MD_POSITION                               0x2
#define _PMD3_CMP2MD_SIZE                                   0x1
#define _PMD3_CMP2MD_LENGTH                                 0x1
#define _PMD3_CMP2MD_MASK                                   0x4
#define _PMD3_CMP3MD_POSN                                   0x3
#define _PMD3_CMP3MD_POSITION                               0x3
#define _PMD3_CMP3MD_SIZE                                   0x1
#define _PMD3_CMP3MD_LENGTH                                 0x1
#define _PMD3_CMP3MD_MASK                                   0x8
#define _PMD3_ADCMD_POSN                                    0x5
#define _PMD3_ADCMD_POSITION                                0x5
#define _PMD3_ADCMD_SIZE                                    0x1
#define _PMD3_ADCMD_LENGTH                                  0x1
#define _PMD3_ADCMD_MASK                                    0x20
#define _PMD3_DACMD_POSN                                    0x6
#define _PMD3_DACMD_POSITION                                0x6
#define _PMD3_DACMD_SIZE                                    0x1
#define _PMD3_DACMD_LENGTH                                  0x1
#define _PMD3_DACMD_MASK                                    0x40

// Register: PMD4
#define PMD4 PMD4
extern volatile unsigned char           PMD4                __at(0xE50);
#ifndef _LIB_BUILD
asm("PMD4 equ 0E50h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP1MD                 :1;
        unsigned CCP2MD                 :1;
        unsigned CCP3MD                 :1;
        unsigned CCP4MD                 :1;
        unsigned CCP5MD                 :1;
        unsigned PWM6MD                 :1;
        unsigned PWM7MD                 :1;
    };
} PMD4bits_t;
extern volatile PMD4bits_t PMD4bits __at(0xE50);
// bitfield macros
#define _PMD4_CCP1MD_POSN                                   0x0
#define _PMD4_CCP1MD_POSITION                               0x0
#define _PMD4_CCP1MD_SIZE                                   0x1
#define _PMD4_CCP1MD_LENGTH                                 0x1
#define _PMD4_CCP1MD_MASK                                   0x1
#define _PMD4_CCP2MD_POSN                                   0x1
#define _PMD4_CCP2MD_POSITION                               0x1
#define _PMD4_CCP2MD_SIZE                                   0x1
#define _PMD4_CCP2MD_LENGTH                                 0x1
#define _PMD4_CCP2MD_MASK                                   0x2
#define _PMD4_CCP3MD_POSN                                   0x2
#define _PMD4_CCP3MD_POSITION                               0x2
#define _PMD4_CCP3MD_SIZE                                   0x1
#define _PMD4_CCP3MD_LENGTH                                 0x1
#define _PMD4_CCP3MD_MASK                                   0x4
#define _PMD4_CCP4MD_POSN                                   0x3
#define _PMD4_CCP4MD_POSITION                               0x3
#define _PMD4_CCP4MD_SIZE                                   0x1
#define _PMD4_CCP4MD_LENGTH                                 0x1
#define _PMD4_CCP4MD_MASK                                   0x8
#define _PMD4_CCP5MD_POSN                                   0x4
#define _PMD4_CCP5MD_POSITION                               0x4
#define _PMD4_CCP5MD_SIZE                                   0x1
#define _PMD4_CCP5MD_LENGTH                                 0x1
#define _PMD4_CCP5MD_MASK                                   0x10
#define _PMD4_PWM6MD_POSN                                   0x5
#define _PMD4_PWM6MD_POSITION                               0x5
#define _PMD4_PWM6MD_SIZE                                   0x1
#define _PMD4_PWM6MD_LENGTH                                 0x1
#define _PMD4_PWM6MD_MASK                                   0x20
#define _PMD4_PWM7MD_POSN                                   0x6
#define _PMD4_PWM7MD_POSITION                               0x6
#define _PMD4_PWM7MD_SIZE                                   0x1
#define _PMD4_PWM7MD_LENGTH                                 0x1
#define _PMD4_PWM7MD_MASK                                   0x40

// Register: PMD5
#define PMD5 PMD5
extern volatile unsigned char           PMD5                __at(0xE51);
#ifndef _LIB_BUILD
asm("PMD5 equ 0E51h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MSSP1MD                :1;
        unsigned MSSP2MD                :1;
        unsigned UART1MD                :1;
        unsigned UART2MD                :1;
        unsigned UART3MD                :1;
        unsigned UART4MD                :1;
        unsigned UART5MD                :1;
    };
} PMD5bits_t;
extern volatile PMD5bits_t PMD5bits __at(0xE51);
// bitfield macros
#define _PMD5_MSSP1MD_POSN                                  0x0
#define _PMD5_MSSP1MD_POSITION                              0x0
#define _PMD5_MSSP1MD_SIZE                                  0x1
#define _PMD5_MSSP1MD_LENGTH                                0x1
#define _PMD5_MSSP1MD_MASK                                  0x1
#define _PMD5_MSSP2MD_POSN                                  0x1
#define _PMD5_MSSP2MD_POSITION                              0x1
#define _PMD5_MSSP2MD_SIZE                                  0x1
#define _PMD5_MSSP2MD_LENGTH                                0x1
#define _PMD5_MSSP2MD_MASK                                  0x2
#define _PMD5_UART1MD_POSN                                  0x2
#define _PMD5_UART1MD_POSITION                              0x2
#define _PMD5_UART1MD_SIZE                                  0x1
#define _PMD5_UART1MD_LENGTH                                0x1
#define _PMD5_UART1MD_MASK                                  0x4
#define _PMD5_UART2MD_POSN                                  0x3
#define _PMD5_UART2MD_POSITION                              0x3
#define _PMD5_UART2MD_SIZE                                  0x1
#define _PMD5_UART2MD_LENGTH                                0x1
#define _PMD5_UART2MD_MASK                                  0x8
#define _PMD5_UART3MD_POSN                                  0x4
#define _PMD5_UART3MD_POSITION                              0x4
#define _PMD5_UART3MD_SIZE                                  0x1
#define _PMD5_UART3MD_LENGTH                                0x1
#define _PMD5_UART3MD_MASK                                  0x10
#define _PMD5_UART4MD_POSN                                  0x5
#define _PMD5_UART4MD_POSITION                              0x5
#define _PMD5_UART4MD_SIZE                                  0x1
#define _PMD5_UART4MD_LENGTH                                0x1
#define _PMD5_UART4MD_MASK                                  0x20
#define _PMD5_UART5MD_POSN                                  0x6
#define _PMD5_UART5MD_POSITION                              0x6
#define _PMD5_UART5MD_SIZE                                  0x1
#define _PMD5_UART5MD_LENGTH                                0x1
#define _PMD5_UART5MD_MASK                                  0x40

// Register: RA0PPS
#define RA0PPS RA0PPS
extern volatile unsigned char           RA0PPS              __at(0xE52);
#ifndef _LIB_BUILD
asm("RA0PPS equ 0E52h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA0PPS0                :1;
        unsigned RA0PPS1                :1;
        unsigned RA0PPS2                :1;
        unsigned RA0PPS3                :1;
        unsigned RA0PPS4                :1;
        unsigned RA0PPS5                :1;
    };
} RA0PPSbits_t;
extern volatile RA0PPSbits_t RA0PPSbits __at(0xE52);
// bitfield macros
#define _RA0PPS_RA0PPS0_POSN                                0x0
#define _RA0PPS_RA0PPS0_POSITION                            0x0
#define _RA0PPS_RA0PPS0_SIZE                                0x1
#define _RA0PPS_RA0PPS0_LENGTH                              0x1
#define _RA0PPS_RA0PPS0_MASK                                0x1
#define _RA0PPS_RA0PPS1_POSN                                0x1
#define _RA0PPS_RA0PPS1_POSITION                            0x1
#define _RA0PPS_RA0PPS1_SIZE                                0x1
#define _RA0PPS_RA0PPS1_LENGTH                              0x1
#define _RA0PPS_RA0PPS1_MASK                                0x2
#define _RA0PPS_RA0PPS2_POSN                                0x2
#define _RA0PPS_RA0PPS2_POSITION                            0x2
#define _RA0PPS_RA0PPS2_SIZE                                0x1
#define _RA0PPS_RA0PPS2_LENGTH                              0x1
#define _RA0PPS_RA0PPS2_MASK                                0x4
#define _RA0PPS_RA0PPS3_POSN                                0x3
#define _RA0PPS_RA0PPS3_POSITION                            0x3
#define _RA0PPS_RA0PPS3_SIZE                                0x1
#define _RA0PPS_RA0PPS3_LENGTH                              0x1
#define _RA0PPS_RA0PPS3_MASK                                0x8
#define _RA0PPS_RA0PPS4_POSN                                0x4
#define _RA0PPS_RA0PPS4_POSITION                            0x4
#define _RA0PPS_RA0PPS4_SIZE                                0x1
#define _RA0PPS_RA0PPS4_LENGTH                              0x1
#define _RA0PPS_RA0PPS4_MASK                                0x10
#define _RA0PPS_RA0PPS5_POSN                                0x5
#define _RA0PPS_RA0PPS5_POSITION                            0x5
#define _RA0PPS_RA0PPS5_SIZE                                0x1
#define _RA0PPS_RA0PPS5_LENGTH                              0x1
#define _RA0PPS_RA0PPS5_MASK                                0x20

// Register: RA1PPS
#define RA1PPS RA1PPS
extern volatile unsigned char           RA1PPS              __at(0xE53);
#ifndef _LIB_BUILD
asm("RA1PPS equ 0E53h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA1PPS0                :1;
        unsigned RA1PPS1                :1;
        unsigned RA1PPS2                :1;
        unsigned RA1PPS3                :1;
        unsigned RA1PPS4                :1;
        unsigned RA1PPS5                :1;
    };
} RA1PPSbits_t;
extern volatile RA1PPSbits_t RA1PPSbits __at(0xE53);
// bitfield macros
#define _RA1PPS_RA1PPS0_POSN                                0x0
#define _RA1PPS_RA1PPS0_POSITION                            0x0
#define _RA1PPS_RA1PPS0_SIZE                                0x1
#define _RA1PPS_RA1PPS0_LENGTH                              0x1
#define _RA1PPS_RA1PPS0_MASK                                0x1
#define _RA1PPS_RA1PPS1_POSN                                0x1
#define _RA1PPS_RA1PPS1_POSITION                            0x1
#define _RA1PPS_RA1PPS1_SIZE                                0x1
#define _RA1PPS_RA1PPS1_LENGTH                              0x1
#define _RA1PPS_RA1PPS1_MASK                                0x2
#define _RA1PPS_RA1PPS2_POSN                                0x2
#define _RA1PPS_RA1PPS2_POSITION                            0x2
#define _RA1PPS_RA1PPS2_SIZE                                0x1
#define _RA1PPS_RA1PPS2_LENGTH                              0x1
#define _RA1PPS_RA1PPS2_MASK                                0x4
#define _RA1PPS_RA1PPS3_POSN                                0x3
#define _RA1PPS_RA1PPS3_POSITION                            0x3
#define _RA1PPS_RA1PPS3_SIZE                                0x1
#define _RA1PPS_RA1PPS3_LENGTH                              0x1
#define _RA1PPS_RA1PPS3_MASK                                0x8
#define _RA1PPS_RA1PPS4_POSN                                0x4
#define _RA1PPS_RA1PPS4_POSITION                            0x4
#define _RA1PPS_RA1PPS4_SIZE                                0x1
#define _RA1PPS_RA1PPS4_LENGTH                              0x1
#define _RA1PPS_RA1PPS4_MASK                                0x10
#define _RA1PPS_RA1PPS5_POSN                                0x5
#define _RA1PPS_RA1PPS5_POSITION                            0x5
#define _RA1PPS_RA1PPS5_SIZE                                0x1
#define _RA1PPS_RA1PPS5_LENGTH                              0x1
#define _RA1PPS_RA1PPS5_MASK                                0x20

// Register: RA2PPS
#define RA2PPS RA2PPS
extern volatile unsigned char           RA2PPS              __at(0xE54);
#ifndef _LIB_BUILD
asm("RA2PPS equ 0E54h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA2PPS0                :1;
        unsigned RA2PPS1                :1;
        unsigned RA2PPS2                :1;
        unsigned RA2PPS3                :1;
        unsigned RA2PPS4                :1;
        unsigned RA2PPS5                :1;
    };
} RA2PPSbits_t;
extern volatile RA2PPSbits_t RA2PPSbits __at(0xE54);
// bitfield macros
#define _RA2PPS_RA2PPS0_POSN                                0x0
#define _RA2PPS_RA2PPS0_POSITION                            0x0
#define _RA2PPS_RA2PPS0_SIZE                                0x1
#define _RA2PPS_RA2PPS0_LENGTH                              0x1
#define _RA2PPS_RA2PPS0_MASK                                0x1
#define _RA2PPS_RA2PPS1_POSN                                0x1
#define _RA2PPS_RA2PPS1_POSITION                            0x1
#define _RA2PPS_RA2PPS1_SIZE                                0x1
#define _RA2PPS_RA2PPS1_LENGTH                              0x1
#define _RA2PPS_RA2PPS1_MASK                                0x2
#define _RA2PPS_RA2PPS2_POSN                                0x2
#define _RA2PPS_RA2PPS2_POSITION                            0x2
#define _RA2PPS_RA2PPS2_SIZE                                0x1
#define _RA2PPS_RA2PPS2_LENGTH                              0x1
#define _RA2PPS_RA2PPS2_MASK                                0x4
#define _RA2PPS_RA2PPS3_POSN                                0x3
#define _RA2PPS_RA2PPS3_POSITION                            0x3
#define _RA2PPS_RA2PPS3_SIZE                                0x1
#define _RA2PPS_RA2PPS3_LENGTH                              0x1
#define _RA2PPS_RA2PPS3_MASK                                0x8
#define _RA2PPS_RA2PPS4_POSN                                0x4
#define _RA2PPS_RA2PPS4_POSITION                            0x4
#define _RA2PPS_RA2PPS4_SIZE                                0x1
#define _RA2PPS_RA2PPS4_LENGTH                              0x1
#define _RA2PPS_RA2PPS4_MASK                                0x10
#define _RA2PPS_RA2PPS5_POSN                                0x5
#define _RA2PPS_RA2PPS5_POSITION                            0x5
#define _RA2PPS_RA2PPS5_SIZE                                0x1
#define _RA2PPS_RA2PPS5_LENGTH                              0x1
#define _RA2PPS_RA2PPS5_MASK                                0x20

