MikroElektronika/core_packages/PIC/XC8/def/PIC18F66K40/mcu.h
extern volatile RE6PPSbits_t RE6PPSbits __at(0xE78);
// bitfield macros
#define _RE6PPS_RE6PPS0_POSN                                0x0
#define _RE6PPS_RE6PPS0_POSITION                            0x0
#define _RE6PPS_RE6PPS0_SIZE                                0x1
#define _RE6PPS_RE6PPS0_LENGTH                              0x1
#define _RE6PPS_RE6PPS0_MASK                                0x1
#define _RE6PPS_RE6PPS1_POSN                                0x1
#define _RE6PPS_RE6PPS1_POSITION                            0x1
#define _RE6PPS_RE6PPS1_SIZE                                0x1
#define _RE6PPS_RE6PPS1_LENGTH                              0x1
#define _RE6PPS_RE6PPS1_MASK                                0x2
#define _RE6PPS_RE6PPS2_POSN                                0x2
#define _RE6PPS_RE6PPS2_POSITION                            0x2
#define _RE6PPS_RE6PPS2_SIZE                                0x1
#define _RE6PPS_RE6PPS2_LENGTH                              0x1
#define _RE6PPS_RE6PPS2_MASK                                0x4
#define _RE6PPS_RE6PPS3_POSN                                0x3
#define _RE6PPS_RE6PPS3_POSITION                            0x3
#define _RE6PPS_RE6PPS3_SIZE                                0x1
#define _RE6PPS_RE6PPS3_LENGTH                              0x1
#define _RE6PPS_RE6PPS3_MASK                                0x8
#define _RE6PPS_RE6PPS4_POSN                                0x4
#define _RE6PPS_RE6PPS4_POSITION                            0x4
#define _RE6PPS_RE6PPS4_SIZE                                0x1
#define _RE6PPS_RE6PPS4_LENGTH                              0x1
#define _RE6PPS_RE6PPS4_MASK                                0x10
#define _RE6PPS_RE6PPS5_POSN                                0x5
#define _RE6PPS_RE6PPS5_POSITION                            0x5
#define _RE6PPS_RE6PPS5_SIZE                                0x1
#define _RE6PPS_RE6PPS5_LENGTH                              0x1
#define _RE6PPS_RE6PPS5_MASK                                0x20

// Register: RE7PPS
#define RE7PPS RE7PPS
extern volatile unsigned char           RE7PPS              __at(0xE79);
#ifndef _LIB_BUILD
asm("RE7PPS equ 0E79h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RE7PPS0                :1;
        unsigned RE7PPS1                :1;
        unsigned RE7PPS2                :1;
        unsigned RE7PPS3                :1;
        unsigned RE7PPS4                :1;
        unsigned RE7PPS5                :1;
    };
} RE7PPSbits_t;
extern volatile RE7PPSbits_t RE7PPSbits __at(0xE79);
// bitfield macros
#define _RE7PPS_RE7PPS0_POSN                                0x0
#define _RE7PPS_RE7PPS0_POSITION                            0x0
#define _RE7PPS_RE7PPS0_SIZE                                0x1
#define _RE7PPS_RE7PPS0_LENGTH                              0x1
#define _RE7PPS_RE7PPS0_MASK                                0x1
#define _RE7PPS_RE7PPS1_POSN                                0x1
#define _RE7PPS_RE7PPS1_POSITION                            0x1
#define _RE7PPS_RE7PPS1_SIZE                                0x1
#define _RE7PPS_RE7PPS1_LENGTH                              0x1
#define _RE7PPS_RE7PPS1_MASK                                0x2
#define _RE7PPS_RE7PPS2_POSN                                0x2
#define _RE7PPS_RE7PPS2_POSITION                            0x2
#define _RE7PPS_RE7PPS2_SIZE                                0x1
#define _RE7PPS_RE7PPS2_LENGTH                              0x1
#define _RE7PPS_RE7PPS2_MASK                                0x4
#define _RE7PPS_RE7PPS3_POSN                                0x3
#define _RE7PPS_RE7PPS3_POSITION                            0x3
#define _RE7PPS_RE7PPS3_SIZE                                0x1
#define _RE7PPS_RE7PPS3_LENGTH                              0x1
#define _RE7PPS_RE7PPS3_MASK                                0x8
#define _RE7PPS_RE7PPS4_POSN                                0x4
#define _RE7PPS_RE7PPS4_POSITION                            0x4
#define _RE7PPS_RE7PPS4_SIZE                                0x1
#define _RE7PPS_RE7PPS4_LENGTH                              0x1
#define _RE7PPS_RE7PPS4_MASK                                0x10
#define _RE7PPS_RE7PPS5_POSN                                0x5
#define _RE7PPS_RE7PPS5_POSITION                            0x5
#define _RE7PPS_RE7PPS5_SIZE                                0x1
#define _RE7PPS_RE7PPS5_LENGTH                              0x1
#define _RE7PPS_RE7PPS5_MASK                                0x20

// Register: RF0PPS
#define RF0PPS RF0PPS
extern volatile unsigned char           RF0PPS              __at(0xE7A);
#ifndef _LIB_BUILD
asm("RF0PPS equ 0E7Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RF0PPS0                :1;
        unsigned RF0PPS1                :1;
        unsigned RF0PPS2                :1;
        unsigned RF0PPS3                :1;
        unsigned RF0PPS4                :1;
        unsigned RF0PPS5                :1;
    };
} RF0PPSbits_t;
extern volatile RF0PPSbits_t RF0PPSbits __at(0xE7A);
// bitfield macros
#define _RF0PPS_RF0PPS0_POSN                                0x0
#define _RF0PPS_RF0PPS0_POSITION                            0x0
#define _RF0PPS_RF0PPS0_SIZE                                0x1
#define _RF0PPS_RF0PPS0_LENGTH                              0x1
#define _RF0PPS_RF0PPS0_MASK                                0x1
#define _RF0PPS_RF0PPS1_POSN                                0x1
#define _RF0PPS_RF0PPS1_POSITION                            0x1
#define _RF0PPS_RF0PPS1_SIZE                                0x1
#define _RF0PPS_RF0PPS1_LENGTH                              0x1
#define _RF0PPS_RF0PPS1_MASK                                0x2
#define _RF0PPS_RF0PPS2_POSN                                0x2
#define _RF0PPS_RF0PPS2_POSITION                            0x2
#define _RF0PPS_RF0PPS2_SIZE                                0x1
#define _RF0PPS_RF0PPS2_LENGTH                              0x1
#define _RF0PPS_RF0PPS2_MASK                                0x4
#define _RF0PPS_RF0PPS3_POSN                                0x3
#define _RF0PPS_RF0PPS3_POSITION                            0x3
#define _RF0PPS_RF0PPS3_SIZE                                0x1
#define _RF0PPS_RF0PPS3_LENGTH                              0x1
#define _RF0PPS_RF0PPS3_MASK                                0x8
#define _RF0PPS_RF0PPS4_POSN                                0x4
#define _RF0PPS_RF0PPS4_POSITION                            0x4
#define _RF0PPS_RF0PPS4_SIZE                                0x1
#define _RF0PPS_RF0PPS4_LENGTH                              0x1
#define _RF0PPS_RF0PPS4_MASK                                0x10
#define _RF0PPS_RF0PPS5_POSN                                0x5
#define _RF0PPS_RF0PPS5_POSITION                            0x5
#define _RF0PPS_RF0PPS5_SIZE                                0x1
#define _RF0PPS_RF0PPS5_LENGTH                              0x1
#define _RF0PPS_RF0PPS5_MASK                                0x20

// Register: RF1PPS
#define RF1PPS RF1PPS
extern volatile unsigned char           RF1PPS              __at(0xE7B);
#ifndef _LIB_BUILD
asm("RF1PPS equ 0E7Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RF1PPS0                :1;
        unsigned RF1PPS1                :1;
        unsigned RF1PPS2                :1;
        unsigned RF1PPS3                :1;
        unsigned RF1PPS4                :1;
        unsigned RF1PPS5                :1;
    };
} RF1PPSbits_t;
extern volatile RF1PPSbits_t RF1PPSbits __at(0xE7B);
// bitfield macros
#define _RF1PPS_RF1PPS0_POSN                                0x0
#define _RF1PPS_RF1PPS0_POSITION                            0x0
#define _RF1PPS_RF1PPS0_SIZE                                0x1
#define _RF1PPS_RF1PPS0_LENGTH                              0x1
#define _RF1PPS_RF1PPS0_MASK                                0x1
#define _RF1PPS_RF1PPS1_POSN                                0x1
#define _RF1PPS_RF1PPS1_POSITION                            0x1
#define _RF1PPS_RF1PPS1_SIZE                                0x1
#define _RF1PPS_RF1PPS1_LENGTH                              0x1
#define _RF1PPS_RF1PPS1_MASK                                0x2
#define _RF1PPS_RF1PPS2_POSN                                0x2
#define _RF1PPS_RF1PPS2_POSITION                            0x2
#define _RF1PPS_RF1PPS2_SIZE                                0x1
#define _RF1PPS_RF1PPS2_LENGTH                              0x1
#define _RF1PPS_RF1PPS2_MASK                                0x4
#define _RF1PPS_RF1PPS3_POSN                                0x3
#define _RF1PPS_RF1PPS3_POSITION                            0x3
#define _RF1PPS_RF1PPS3_SIZE                                0x1
#define _RF1PPS_RF1PPS3_LENGTH                              0x1
#define _RF1PPS_RF1PPS3_MASK                                0x8
#define _RF1PPS_RF1PPS4_POSN                                0x4
#define _RF1PPS_RF1PPS4_POSITION                            0x4
#define _RF1PPS_RF1PPS4_SIZE                                0x1
#define _RF1PPS_RF1PPS4_LENGTH                              0x1
#define _RF1PPS_RF1PPS4_MASK                                0x10
#define _RF1PPS_RF1PPS5_POSN                                0x5
#define _RF1PPS_RF1PPS5_POSITION                            0x5
#define _RF1PPS_RF1PPS5_SIZE                                0x1
#define _RF1PPS_RF1PPS5_LENGTH                              0x1
#define _RF1PPS_RF1PPS5_MASK                                0x20

// Register: RF2PPS
#define RF2PPS RF2PPS
extern volatile unsigned char           RF2PPS              __at(0xE7C);
#ifndef _LIB_BUILD
asm("RF2PPS equ 0E7Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RF2PPS0                :1;
        unsigned RF2PPS1                :1;
        unsigned RF2PPS2                :1;
        unsigned RF2PPS3                :1;
        unsigned RF2PPS4                :1;
        unsigned RF2PPS5                :1;
    };
} RF2PPSbits_t;
extern volatile RF2PPSbits_t RF2PPSbits __at(0xE7C);
// bitfield macros
#define _RF2PPS_RF2PPS0_POSN                                0x0
#define _RF2PPS_RF2PPS0_POSITION                            0x0
#define _RF2PPS_RF2PPS0_SIZE                                0x1
#define _RF2PPS_RF2PPS0_LENGTH                              0x1
#define _RF2PPS_RF2PPS0_MASK                                0x1
#define _RF2PPS_RF2PPS1_POSN                                0x1
#define _RF2PPS_RF2PPS1_POSITION                            0x1
#define _RF2PPS_RF2PPS1_SIZE                                0x1
#define _RF2PPS_RF2PPS1_LENGTH                              0x1
#define _RF2PPS_RF2PPS1_MASK                                0x2
#define _RF2PPS_RF2PPS2_POSN                                0x2
#define _RF2PPS_RF2PPS2_POSITION                            0x2
#define _RF2PPS_RF2PPS2_SIZE                                0x1
#define _RF2PPS_RF2PPS2_LENGTH                              0x1
#define _RF2PPS_RF2PPS2_MASK                                0x4
#define _RF2PPS_RF2PPS3_POSN                                0x3
#define _RF2PPS_RF2PPS3_POSITION                            0x3
#define _RF2PPS_RF2PPS3_SIZE                                0x1
#define _RF2PPS_RF2PPS3_LENGTH                              0x1
#define _RF2PPS_RF2PPS3_MASK                                0x8
#define _RF2PPS_RF2PPS4_POSN                                0x4
#define _RF2PPS_RF2PPS4_POSITION                            0x4
#define _RF2PPS_RF2PPS4_SIZE                                0x1
#define _RF2PPS_RF2PPS4_LENGTH                              0x1
#define _RF2PPS_RF2PPS4_MASK                                0x10
#define _RF2PPS_RF2PPS5_POSN                                0x5
#define _RF2PPS_RF2PPS5_POSITION                            0x5
#define _RF2PPS_RF2PPS5_SIZE                                0x1
#define _RF2PPS_RF2PPS5_LENGTH                              0x1
#define _RF2PPS_RF2PPS5_MASK                                0x20

