MikroElektronika/core_packages/PIC/XC8/def/PIC18F66K40/mcu.h
extern volatile TX5STAbits_t TX5STAbits __at(0xEE1);
// bitfield macros
#define _TX5STA_TX9D_POSN                                   0x0
#define _TX5STA_TX9D_POSITION                               0x0
#define _TX5STA_TX9D_SIZE                                   0x1
#define _TX5STA_TX9D_LENGTH                                 0x1
#define _TX5STA_TX9D_MASK                                   0x1
#define _TX5STA_TRMT_POSN                                   0x1
#define _TX5STA_TRMT_POSITION                               0x1
#define _TX5STA_TRMT_SIZE                                   0x1
#define _TX5STA_TRMT_LENGTH                                 0x1
#define _TX5STA_TRMT_MASK                                   0x2
#define _TX5STA_BRGH_POSN                                   0x2
#define _TX5STA_BRGH_POSITION                               0x2
#define _TX5STA_BRGH_SIZE                                   0x1
#define _TX5STA_BRGH_LENGTH                                 0x1
#define _TX5STA_BRGH_MASK                                   0x4
#define _TX5STA_SENDB_POSN                                  0x3
#define _TX5STA_SENDB_POSITION                              0x3
#define _TX5STA_SENDB_SIZE                                  0x1
#define _TX5STA_SENDB_LENGTH                                0x1
#define _TX5STA_SENDB_MASK                                  0x8
#define _TX5STA_SYNC_POSN                                   0x4
#define _TX5STA_SYNC_POSITION                               0x4
#define _TX5STA_SYNC_SIZE                                   0x1
#define _TX5STA_SYNC_LENGTH                                 0x1
#define _TX5STA_SYNC_MASK                                   0x10
#define _TX5STA_TXEN_POSN                                   0x5
#define _TX5STA_TXEN_POSITION                               0x5
#define _TX5STA_TXEN_SIZE                                   0x1
#define _TX5STA_TXEN_LENGTH                                 0x1
#define _TX5STA_TXEN_MASK                                   0x20
#define _TX5STA_TX9_POSN                                    0x6
#define _TX5STA_TX9_POSITION                                0x6
#define _TX5STA_TX9_SIZE                                    0x1
#define _TX5STA_TX9_LENGTH                                  0x1
#define _TX5STA_TX9_MASK                                    0x40
#define _TX5STA_CSRC_POSN                                   0x7
#define _TX5STA_CSRC_POSITION                               0x7
#define _TX5STA_CSRC_SIZE                                   0x1
#define _TX5STA_CSRC_LENGTH                                 0x1
#define _TX5STA_CSRC_MASK                                   0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned TX9D                   :1;
        unsigned TRMT                   :1;
        unsigned BRGH                   :1;
        unsigned SENDB                  :1;
        unsigned SYNC                   :1;
        unsigned TXEN                   :1;
        unsigned TX9                    :1;
        unsigned CSRC                   :1;
    };
} TXSTA5bits_t;
extern volatile TXSTA5bits_t TXSTA5bits __at(0xEE1);
// bitfield macros
#define _TXSTA5_TX9D_POSN                                   0x0
#define _TXSTA5_TX9D_POSITION                               0x0
#define _TXSTA5_TX9D_SIZE                                   0x1
#define _TXSTA5_TX9D_LENGTH                                 0x1
#define _TXSTA5_TX9D_MASK                                   0x1
#define _TXSTA5_TRMT_POSN                                   0x1
#define _TXSTA5_TRMT_POSITION                               0x1
#define _TXSTA5_TRMT_SIZE                                   0x1
#define _TXSTA5_TRMT_LENGTH                                 0x1
#define _TXSTA5_TRMT_MASK                                   0x2
#define _TXSTA5_BRGH_POSN                                   0x2
#define _TXSTA5_BRGH_POSITION                               0x2
#define _TXSTA5_BRGH_SIZE                                   0x1
#define _TXSTA5_BRGH_LENGTH                                 0x1
#define _TXSTA5_BRGH_MASK                                   0x4
#define _TXSTA5_SENDB_POSN                                  0x3
#define _TXSTA5_SENDB_POSITION                              0x3
#define _TXSTA5_SENDB_SIZE                                  0x1
#define _TXSTA5_SENDB_LENGTH                                0x1
#define _TXSTA5_SENDB_MASK                                  0x8
#define _TXSTA5_SYNC_POSN                                   0x4
#define _TXSTA5_SYNC_POSITION                               0x4
#define _TXSTA5_SYNC_SIZE                                   0x1
#define _TXSTA5_SYNC_LENGTH                                 0x1
#define _TXSTA5_SYNC_MASK                                   0x10
#define _TXSTA5_TXEN_POSN                                   0x5
#define _TXSTA5_TXEN_POSITION                               0x5
#define _TXSTA5_TXEN_SIZE                                   0x1
#define _TXSTA5_TXEN_LENGTH                                 0x1
#define _TXSTA5_TXEN_MASK                                   0x20
#define _TXSTA5_TX9_POSN                                    0x6
#define _TXSTA5_TX9_POSITION                                0x6
#define _TXSTA5_TX9_SIZE                                    0x1
#define _TXSTA5_TX9_LENGTH                                  0x1
#define _TXSTA5_TX9_MASK                                    0x40
#define _TXSTA5_CSRC_POSN                                   0x7
#define _TXSTA5_CSRC_POSITION                               0x7
#define _TXSTA5_CSRC_SIZE                                   0x1
#define _TXSTA5_CSRC_LENGTH                                 0x1
#define _TXSTA5_CSRC_MASK                                   0x80

// Register: BAUD5CON
#define BAUD5CON BAUD5CON
extern volatile unsigned char           BAUD5CON            __at(0xEE2);
#ifndef _LIB_BUILD
asm("BAUD5CON equ 0EE2h");
#endif
// aliases
extern volatile unsigned char           BAUDCON5            __at(0xEE2);
#ifndef _LIB_BUILD
asm("BAUDCON5 equ 0EE2h");
#endif
extern volatile unsigned char           BAUDCTL5            __at(0xEE2);
#ifndef _LIB_BUILD
asm("BAUDCTL5 equ 0EE2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ABDEN                  :1;
        unsigned WUE                    :1;
        unsigned                        :1;
        unsigned BRG16                  :1;
        unsigned SCKP                   :1;
        unsigned                        :1;
        unsigned RCIDL                  :1;
        unsigned ABDOVF                 :1;
    };
} BAUD5CONbits_t;
extern volatile BAUD5CONbits_t BAUD5CONbits __at(0xEE2);
// bitfield macros
#define _BAUD5CON_ABDEN_POSN                                0x0
#define _BAUD5CON_ABDEN_POSITION                            0x0
#define _BAUD5CON_ABDEN_SIZE                                0x1
#define _BAUD5CON_ABDEN_LENGTH                              0x1
#define _BAUD5CON_ABDEN_MASK                                0x1
#define _BAUD5CON_WUE_POSN                                  0x1
#define _BAUD5CON_WUE_POSITION                              0x1
#define _BAUD5CON_WUE_SIZE                                  0x1
#define _BAUD5CON_WUE_LENGTH                                0x1
#define _BAUD5CON_WUE_MASK                                  0x2
#define _BAUD5CON_BRG16_POSN                                0x3
#define _BAUD5CON_BRG16_POSITION                            0x3
#define _BAUD5CON_BRG16_SIZE                                0x1
#define _BAUD5CON_BRG16_LENGTH                              0x1
#define _BAUD5CON_BRG16_MASK                                0x8
#define _BAUD5CON_SCKP_POSN                                 0x4
#define _BAUD5CON_SCKP_POSITION                             0x4
#define _BAUD5CON_SCKP_SIZE                                 0x1
#define _BAUD5CON_SCKP_LENGTH                               0x1
#define _BAUD5CON_SCKP_MASK                                 0x10
#define _BAUD5CON_RCIDL_POSN                                0x6
#define _BAUD5CON_RCIDL_POSITION                            0x6
#define _BAUD5CON_RCIDL_SIZE                                0x1
#define _BAUD5CON_RCIDL_LENGTH                              0x1
#define _BAUD5CON_RCIDL_MASK                                0x40
#define _BAUD5CON_ABDOVF_POSN                               0x7
#define _BAUD5CON_ABDOVF_POSITION                           0x7
#define _BAUD5CON_ABDOVF_SIZE                               0x1
#define _BAUD5CON_ABDOVF_LENGTH                             0x1
#define _BAUD5CON_ABDOVF_MASK                               0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned ABDEN                  :1;
        unsigned WUE                    :1;
        unsigned                        :1;
        unsigned BRG16                  :1;
        unsigned SCKP                   :1;
        unsigned                        :1;
        unsigned RCIDL                  :1;
        unsigned ABDOVF                 :1;
    };
} BAUDCON5bits_t;
