MikroElektronika/core_packages/PIC/XC8/def/PIC18F66K40/mcu.h
extern volatile TXSTA4bits_t TXSTA4bits __at(0xEE8);
// bitfield macros
#define _TXSTA4_TX9D_POSN                                   0x0
#define _TXSTA4_TX9D_POSITION                               0x0
#define _TXSTA4_TX9D_SIZE                                   0x1
#define _TXSTA4_TX9D_LENGTH                                 0x1
#define _TXSTA4_TX9D_MASK                                   0x1
#define _TXSTA4_TRMT_POSN                                   0x1
#define _TXSTA4_TRMT_POSITION                               0x1
#define _TXSTA4_TRMT_SIZE                                   0x1
#define _TXSTA4_TRMT_LENGTH                                 0x1
#define _TXSTA4_TRMT_MASK                                   0x2
#define _TXSTA4_BRGH_POSN                                   0x2
#define _TXSTA4_BRGH_POSITION                               0x2
#define _TXSTA4_BRGH_SIZE                                   0x1
#define _TXSTA4_BRGH_LENGTH                                 0x1
#define _TXSTA4_BRGH_MASK                                   0x4
#define _TXSTA4_SENDB_POSN                                  0x3
#define _TXSTA4_SENDB_POSITION                              0x3
#define _TXSTA4_SENDB_SIZE                                  0x1
#define _TXSTA4_SENDB_LENGTH                                0x1
#define _TXSTA4_SENDB_MASK                                  0x8
#define _TXSTA4_SYNC_POSN                                   0x4
#define _TXSTA4_SYNC_POSITION                               0x4
#define _TXSTA4_SYNC_SIZE                                   0x1
#define _TXSTA4_SYNC_LENGTH                                 0x1
#define _TXSTA4_SYNC_MASK                                   0x10
#define _TXSTA4_TXEN_POSN                                   0x5
#define _TXSTA4_TXEN_POSITION                               0x5
#define _TXSTA4_TXEN_SIZE                                   0x1
#define _TXSTA4_TXEN_LENGTH                                 0x1
#define _TXSTA4_TXEN_MASK                                   0x20
#define _TXSTA4_TX9_POSN                                    0x6
#define _TXSTA4_TX9_POSITION                                0x6
#define _TXSTA4_TX9_SIZE                                    0x1
#define _TXSTA4_TX9_LENGTH                                  0x1
#define _TXSTA4_TX9_MASK                                    0x40
#define _TXSTA4_CSRC_POSN                                   0x7
#define _TXSTA4_CSRC_POSITION                               0x7
#define _TXSTA4_CSRC_SIZE                                   0x1
#define _TXSTA4_CSRC_LENGTH                                 0x1
#define _TXSTA4_CSRC_MASK                                   0x80

// Register: BAUD4CON
#define BAUD4CON BAUD4CON
extern volatile unsigned char           BAUD4CON            __at(0xEE9);
#ifndef _LIB_BUILD
asm("BAUD4CON equ 0EE9h");
#endif
// aliases
extern volatile unsigned char           BAUDCON4            __at(0xEE9);
#ifndef _LIB_BUILD
asm("BAUDCON4 equ 0EE9h");
#endif
extern volatile unsigned char           BAUDCTL4            __at(0xEE9);
#ifndef _LIB_BUILD
asm("BAUDCTL4 equ 0EE9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ABDEN                  :1;
        unsigned WUE                    :1;
        unsigned                        :1;
        unsigned BRG16                  :1;
        unsigned SCKP                   :1;
        unsigned                        :1;
        unsigned RCIDL                  :1;
        unsigned ABDOVF                 :1;
    };
} BAUD4CONbits_t;
extern volatile BAUD4CONbits_t BAUD4CONbits __at(0xEE9);
// bitfield macros
#define _BAUD4CON_ABDEN_POSN                                0x0
#define _BAUD4CON_ABDEN_POSITION                            0x0
#define _BAUD4CON_ABDEN_SIZE                                0x1
#define _BAUD4CON_ABDEN_LENGTH                              0x1
#define _BAUD4CON_ABDEN_MASK                                0x1
#define _BAUD4CON_WUE_POSN                                  0x1
#define _BAUD4CON_WUE_POSITION                              0x1
#define _BAUD4CON_WUE_SIZE                                  0x1
#define _BAUD4CON_WUE_LENGTH                                0x1
#define _BAUD4CON_WUE_MASK                                  0x2
#define _BAUD4CON_BRG16_POSN                                0x3
#define _BAUD4CON_BRG16_POSITION                            0x3
#define _BAUD4CON_BRG16_SIZE                                0x1
#define _BAUD4CON_BRG16_LENGTH                              0x1
#define _BAUD4CON_BRG16_MASK                                0x8
#define _BAUD4CON_SCKP_POSN                                 0x4
#define _BAUD4CON_SCKP_POSITION                             0x4
#define _BAUD4CON_SCKP_SIZE                                 0x1
#define _BAUD4CON_SCKP_LENGTH                               0x1
#define _BAUD4CON_SCKP_MASK                                 0x10
#define _BAUD4CON_RCIDL_POSN                                0x6
#define _BAUD4CON_RCIDL_POSITION                            0x6
#define _BAUD4CON_RCIDL_SIZE                                0x1
#define _BAUD4CON_RCIDL_LENGTH                              0x1
#define _BAUD4CON_RCIDL_MASK                                0x40
#define _BAUD4CON_ABDOVF_POSN                               0x7
#define _BAUD4CON_ABDOVF_POSITION                           0x7
#define _BAUD4CON_ABDOVF_SIZE                               0x1
#define _BAUD4CON_ABDOVF_LENGTH                             0x1
#define _BAUD4CON_ABDOVF_MASK                               0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned ABDEN                  :1;
        unsigned WUE                    :1;
        unsigned                        :1;
        unsigned BRG16                  :1;
        unsigned SCKP                   :1;
        unsigned                        :1;
        unsigned RCIDL                  :1;
        unsigned ABDOVF                 :1;
    };
} BAUDCON4bits_t;
extern volatile BAUDCON4bits_t BAUDCON4bits __at(0xEE9);
// bitfield macros
#define _BAUDCON4_ABDEN_POSN                                0x0
#define _BAUDCON4_ABDEN_POSITION                            0x0
#define _BAUDCON4_ABDEN_SIZE                                0x1
#define _BAUDCON4_ABDEN_LENGTH                              0x1
#define _BAUDCON4_ABDEN_MASK                                0x1
#define _BAUDCON4_WUE_POSN                                  0x1
#define _BAUDCON4_WUE_POSITION                              0x1
#define _BAUDCON4_WUE_SIZE                                  0x1
#define _BAUDCON4_WUE_LENGTH                                0x1
#define _BAUDCON4_WUE_MASK                                  0x2
#define _BAUDCON4_BRG16_POSN                                0x3
#define _BAUDCON4_BRG16_POSITION                            0x3
#define _BAUDCON4_BRG16_SIZE                                0x1
#define _BAUDCON4_BRG16_LENGTH                              0x1
#define _BAUDCON4_BRG16_MASK                                0x8
#define _BAUDCON4_SCKP_POSN                                 0x4
#define _BAUDCON4_SCKP_POSITION                             0x4
#define _BAUDCON4_SCKP_SIZE                                 0x1
#define _BAUDCON4_SCKP_LENGTH                               0x1
#define _BAUDCON4_SCKP_MASK                                 0x10
#define _BAUDCON4_RCIDL_POSN                                0x6
#define _BAUDCON4_RCIDL_POSITION                            0x6
#define _BAUDCON4_RCIDL_SIZE                                0x1
#define _BAUDCON4_RCIDL_LENGTH                              0x1
#define _BAUDCON4_RCIDL_MASK                                0x40
#define _BAUDCON4_ABDOVF_POSN                               0x7
#define _BAUDCON4_ABDOVF_POSITION                           0x7
#define _BAUDCON4_ABDOVF_SIZE                               0x1
#define _BAUDCON4_ABDOVF_LENGTH                             0x1
#define _BAUDCON4_ABDOVF_MASK                               0x80
typedef union {
    struct {
        unsigned ABDEN                  :1;
        unsigned WUE                    :1;
        unsigned                        :1;
        unsigned BRG16                  :1;
        unsigned SCKP                   :1;
        unsigned                        :1;
        unsigned RCIDL                  :1;
        unsigned ABDOVF                 :1;
    };
} BAUDCTL4bits_t;
