MikroElektronika/core_packages/PIC/XC8/def/PIC18F66K40/mcu.h
// Register: SMT2TMRL
#define SMT2TMRL SMT2TMRL
extern volatile unsigned char           SMT2TMRL            __at(0xEF8);
#ifndef _LIB_BUILD
asm("SMT2TMRL equ 0EF8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SMT2TMR                :8;
    };
    struct {
        unsigned SMT2TMR0               :1;
        unsigned SMT2TMR1               :1;
        unsigned SMT2TMR2               :1;
        unsigned SMT2TMR3               :1;
        unsigned SMT2TMR4               :1;
        unsigned SMT2TMR5               :1;
        unsigned SMT2TMR6               :1;
        unsigned SMT2TMR7               :1;
    };
} SMT2TMRLbits_t;
extern volatile SMT2TMRLbits_t SMT2TMRLbits __at(0xEF8);
// bitfield macros
#define _SMT2TMRL_SMT2TMR_POSN                              0x0
#define _SMT2TMRL_SMT2TMR_POSITION                          0x0
#define _SMT2TMRL_SMT2TMR_SIZE                              0x8
#define _SMT2TMRL_SMT2TMR_LENGTH                            0x8
#define _SMT2TMRL_SMT2TMR_MASK                              0xFF
#define _SMT2TMRL_SMT2TMR0_POSN                             0x0
#define _SMT2TMRL_SMT2TMR0_POSITION                         0x0
#define _SMT2TMRL_SMT2TMR0_SIZE                             0x1
#define _SMT2TMRL_SMT2TMR0_LENGTH                           0x1
#define _SMT2TMRL_SMT2TMR0_MASK                             0x1
#define _SMT2TMRL_SMT2TMR1_POSN                             0x1
#define _SMT2TMRL_SMT2TMR1_POSITION                         0x1
#define _SMT2TMRL_SMT2TMR1_SIZE                             0x1
#define _SMT2TMRL_SMT2TMR1_LENGTH                           0x1
#define _SMT2TMRL_SMT2TMR1_MASK                             0x2
#define _SMT2TMRL_SMT2TMR2_POSN                             0x2
#define _SMT2TMRL_SMT2TMR2_POSITION                         0x2
#define _SMT2TMRL_SMT2TMR2_SIZE                             0x1
#define _SMT2TMRL_SMT2TMR2_LENGTH                           0x1
#define _SMT2TMRL_SMT2TMR2_MASK                             0x4
#define _SMT2TMRL_SMT2TMR3_POSN                             0x3
#define _SMT2TMRL_SMT2TMR3_POSITION                         0x3
#define _SMT2TMRL_SMT2TMR3_SIZE                             0x1
#define _SMT2TMRL_SMT2TMR3_LENGTH                           0x1
#define _SMT2TMRL_SMT2TMR3_MASK                             0x8
#define _SMT2TMRL_SMT2TMR4_POSN                             0x4
#define _SMT2TMRL_SMT2TMR4_POSITION                         0x4
#define _SMT2TMRL_SMT2TMR4_SIZE                             0x1
#define _SMT2TMRL_SMT2TMR4_LENGTH                           0x1
#define _SMT2TMRL_SMT2TMR4_MASK                             0x10
#define _SMT2TMRL_SMT2TMR5_POSN                             0x5
#define _SMT2TMRL_SMT2TMR5_POSITION                         0x5
#define _SMT2TMRL_SMT2TMR5_SIZE                             0x1
#define _SMT2TMRL_SMT2TMR5_LENGTH                           0x1
#define _SMT2TMRL_SMT2TMR5_MASK                             0x20
#define _SMT2TMRL_SMT2TMR6_POSN                             0x6
#define _SMT2TMRL_SMT2TMR6_POSITION                         0x6
#define _SMT2TMRL_SMT2TMR6_SIZE                             0x1
#define _SMT2TMRL_SMT2TMR6_LENGTH                           0x1
#define _SMT2TMRL_SMT2TMR6_MASK                             0x40
#define _SMT2TMRL_SMT2TMR7_POSN                             0x7
#define _SMT2TMRL_SMT2TMR7_POSITION                         0x7
#define _SMT2TMRL_SMT2TMR7_SIZE                             0x1
#define _SMT2TMRL_SMT2TMR7_LENGTH                           0x1
#define _SMT2TMRL_SMT2TMR7_MASK                             0x80

// Register: SMT2TMRH
#define SMT2TMRH SMT2TMRH
extern volatile unsigned char           SMT2TMRH            __at(0xEF9);
#ifndef _LIB_BUILD
asm("SMT2TMRH equ 0EF9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SMT2TMR                :8;
    };
    struct {
        unsigned SMT2TMR8               :1;
        unsigned SMT2TMR9               :1;
        unsigned SMT2TMR10              :1;
        unsigned SMT2TMR11              :1;
        unsigned SMT2TMR12              :1;
        unsigned SMT2TMR13              :1;
        unsigned SMT2TMR14              :1;
        unsigned SMT2TMR15              :1;
    };
} SMT2TMRHbits_t;
extern volatile SMT2TMRHbits_t SMT2TMRHbits __at(0xEF9);
// bitfield macros
#define _SMT2TMRH_SMT2TMR_POSN                              0x0
#define _SMT2TMRH_SMT2TMR_POSITION                          0x0
#define _SMT2TMRH_SMT2TMR_SIZE                              0x8
#define _SMT2TMRH_SMT2TMR_LENGTH                            0x8
#define _SMT2TMRH_SMT2TMR_MASK                              0xFF
#define _SMT2TMRH_SMT2TMR8_POSN                             0x0
#define _SMT2TMRH_SMT2TMR8_POSITION                         0x0
#define _SMT2TMRH_SMT2TMR8_SIZE                             0x1
#define _SMT2TMRH_SMT2TMR8_LENGTH                           0x1
#define _SMT2TMRH_SMT2TMR8_MASK                             0x1
#define _SMT2TMRH_SMT2TMR9_POSN                             0x1
#define _SMT2TMRH_SMT2TMR9_POSITION                         0x1
#define _SMT2TMRH_SMT2TMR9_SIZE                             0x1
#define _SMT2TMRH_SMT2TMR9_LENGTH                           0x1
#define _SMT2TMRH_SMT2TMR9_MASK                             0x2
#define _SMT2TMRH_SMT2TMR10_POSN                            0x2
#define _SMT2TMRH_SMT2TMR10_POSITION                        0x2
#define _SMT2TMRH_SMT2TMR10_SIZE                            0x1
#define _SMT2TMRH_SMT2TMR10_LENGTH                          0x1
#define _SMT2TMRH_SMT2TMR10_MASK                            0x4
#define _SMT2TMRH_SMT2TMR11_POSN                            0x3
#define _SMT2TMRH_SMT2TMR11_POSITION                        0x3
#define _SMT2TMRH_SMT2TMR11_SIZE                            0x1
#define _SMT2TMRH_SMT2TMR11_LENGTH                          0x1
#define _SMT2TMRH_SMT2TMR11_MASK                            0x8
#define _SMT2TMRH_SMT2TMR12_POSN                            0x4
#define _SMT2TMRH_SMT2TMR12_POSITION                        0x4
#define _SMT2TMRH_SMT2TMR12_SIZE                            0x1
#define _SMT2TMRH_SMT2TMR12_LENGTH                          0x1
#define _SMT2TMRH_SMT2TMR12_MASK                            0x10
#define _SMT2TMRH_SMT2TMR13_POSN                            0x5
#define _SMT2TMRH_SMT2TMR13_POSITION                        0x5
#define _SMT2TMRH_SMT2TMR13_SIZE                            0x1
#define _SMT2TMRH_SMT2TMR13_LENGTH                          0x1
#define _SMT2TMRH_SMT2TMR13_MASK                            0x20
#define _SMT2TMRH_SMT2TMR14_POSN                            0x6
#define _SMT2TMRH_SMT2TMR14_POSITION                        0x6
#define _SMT2TMRH_SMT2TMR14_SIZE                            0x1
#define _SMT2TMRH_SMT2TMR14_LENGTH                          0x1
#define _SMT2TMRH_SMT2TMR14_MASK                            0x40
#define _SMT2TMRH_SMT2TMR15_POSN                            0x7
#define _SMT2TMRH_SMT2TMR15_POSITION                        0x7
#define _SMT2TMRH_SMT2TMR15_SIZE                            0x1
#define _SMT2TMRH_SMT2TMR15_LENGTH                          0x1
#define _SMT2TMRH_SMT2TMR15_MASK                            0x80

