MikroElektronika/core_packages/PIC/XC8/def/PIC18F66K40/mcu.h
// Register: SMT2TMRU
#define SMT2TMRU SMT2TMRU
extern volatile unsigned char           SMT2TMRU            __at(0xEFA);
#ifndef _LIB_BUILD
asm("SMT2TMRU equ 0EFAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SMT2TMR                :8;
    };
    struct {
        unsigned SMT2TMR16              :1;
        unsigned SMT2TMR17              :1;
        unsigned SMT2TMR18              :1;
        unsigned SMT2TMR19              :1;
        unsigned SMT2TMR20              :1;
        unsigned SMT2TMR21              :1;
        unsigned SMT2TMR22              :1;
        unsigned SMT2TMR23              :1;
    };
} SMT2TMRUbits_t;
extern volatile SMT2TMRUbits_t SMT2TMRUbits __at(0xEFA);
// bitfield macros
#define _SMT2TMRU_SMT2TMR_POSN                              0x0
#define _SMT2TMRU_SMT2TMR_POSITION                          0x0
#define _SMT2TMRU_SMT2TMR_SIZE                              0x8
#define _SMT2TMRU_SMT2TMR_LENGTH                            0x8
#define _SMT2TMRU_SMT2TMR_MASK                              0xFF
#define _SMT2TMRU_SMT2TMR16_POSN                            0x0
#define _SMT2TMRU_SMT2TMR16_POSITION                        0x0
#define _SMT2TMRU_SMT2TMR16_SIZE                            0x1
#define _SMT2TMRU_SMT2TMR16_LENGTH                          0x1
#define _SMT2TMRU_SMT2TMR16_MASK                            0x1
#define _SMT2TMRU_SMT2TMR17_POSN                            0x1
#define _SMT2TMRU_SMT2TMR17_POSITION                        0x1
#define _SMT2TMRU_SMT2TMR17_SIZE                            0x1
#define _SMT2TMRU_SMT2TMR17_LENGTH                          0x1
#define _SMT2TMRU_SMT2TMR17_MASK                            0x2
#define _SMT2TMRU_SMT2TMR18_POSN                            0x2
#define _SMT2TMRU_SMT2TMR18_POSITION                        0x2
#define _SMT2TMRU_SMT2TMR18_SIZE                            0x1
#define _SMT2TMRU_SMT2TMR18_LENGTH                          0x1
#define _SMT2TMRU_SMT2TMR18_MASK                            0x4
#define _SMT2TMRU_SMT2TMR19_POSN                            0x3
#define _SMT2TMRU_SMT2TMR19_POSITION                        0x3
#define _SMT2TMRU_SMT2TMR19_SIZE                            0x1
#define _SMT2TMRU_SMT2TMR19_LENGTH                          0x1
#define _SMT2TMRU_SMT2TMR19_MASK                            0x8
#define _SMT2TMRU_SMT2TMR20_POSN                            0x4
#define _SMT2TMRU_SMT2TMR20_POSITION                        0x4
#define _SMT2TMRU_SMT2TMR20_SIZE                            0x1
#define _SMT2TMRU_SMT2TMR20_LENGTH                          0x1
#define _SMT2TMRU_SMT2TMR20_MASK                            0x10
#define _SMT2TMRU_SMT2TMR21_POSN                            0x5
#define _SMT2TMRU_SMT2TMR21_POSITION                        0x5
#define _SMT2TMRU_SMT2TMR21_SIZE                            0x1
#define _SMT2TMRU_SMT2TMR21_LENGTH                          0x1
#define _SMT2TMRU_SMT2TMR21_MASK                            0x20
#define _SMT2TMRU_SMT2TMR22_POSN                            0x6
#define _SMT2TMRU_SMT2TMR22_POSITION                        0x6
#define _SMT2TMRU_SMT2TMR22_SIZE                            0x1
#define _SMT2TMRU_SMT2TMR22_LENGTH                          0x1
#define _SMT2TMRU_SMT2TMR22_MASK                            0x40
#define _SMT2TMRU_SMT2TMR23_POSN                            0x7
#define _SMT2TMRU_SMT2TMR23_POSITION                        0x7
#define _SMT2TMRU_SMT2TMR23_SIZE                            0x1
#define _SMT2TMRU_SMT2TMR23_LENGTH                          0x1
#define _SMT2TMRU_SMT2TMR23_MASK                            0x80

// Register: SMT2CPR
#define SMT2CPR SMT2CPR
#ifndef __CCI__
extern volatile __uint24                SMT2CPR             __at(0xEFB);
#endif
#ifndef _LIB_BUILD
asm("SMT2CPR equ 0EFBh");
#endif

// Register: SMT2CPRL
#define SMT2CPRL SMT2CPRL
extern volatile unsigned char           SMT2CPRL            __at(0xEFB);
#ifndef _LIB_BUILD
asm("SMT2CPRL equ 0EFBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SMT2CPR                :8;
    };
    struct {
        unsigned SMT2CPR0               :1;
        unsigned SMT2CPR1               :1;
        unsigned SMT2CPR2               :1;
        unsigned SMT2CPR3               :1;
        unsigned SMT2CPR4               :1;
        unsigned SMT2CPR5               :1;
        unsigned SMT2CPR6               :1;
        unsigned SMT2CPR7               :1;
    };
} SMT2CPRLbits_t;
extern volatile SMT2CPRLbits_t SMT2CPRLbits __at(0xEFB);
// bitfield macros
#define _SMT2CPRL_SMT2CPR_POSN                              0x0
#define _SMT2CPRL_SMT2CPR_POSITION                          0x0
#define _SMT2CPRL_SMT2CPR_SIZE                              0x8
#define _SMT2CPRL_SMT2CPR_LENGTH                            0x8
#define _SMT2CPRL_SMT2CPR_MASK                              0xFF
#define _SMT2CPRL_SMT2CPR0_POSN                             0x0
#define _SMT2CPRL_SMT2CPR0_POSITION                         0x0
#define _SMT2CPRL_SMT2CPR0_SIZE                             0x1
#define _SMT2CPRL_SMT2CPR0_LENGTH                           0x1
#define _SMT2CPRL_SMT2CPR0_MASK                             0x1
#define _SMT2CPRL_SMT2CPR1_POSN                             0x1
#define _SMT2CPRL_SMT2CPR1_POSITION                         0x1
#define _SMT2CPRL_SMT2CPR1_SIZE                             0x1
#define _SMT2CPRL_SMT2CPR1_LENGTH                           0x1
#define _SMT2CPRL_SMT2CPR1_MASK                             0x2
#define _SMT2CPRL_SMT2CPR2_POSN                             0x2
#define _SMT2CPRL_SMT2CPR2_POSITION                         0x2
#define _SMT2CPRL_SMT2CPR2_SIZE                             0x1
#define _SMT2CPRL_SMT2CPR2_LENGTH                           0x1
#define _SMT2CPRL_SMT2CPR2_MASK                             0x4
#define _SMT2CPRL_SMT2CPR3_POSN                             0x3
#define _SMT2CPRL_SMT2CPR3_POSITION                         0x3
#define _SMT2CPRL_SMT2CPR3_SIZE                             0x1
#define _SMT2CPRL_SMT2CPR3_LENGTH                           0x1
#define _SMT2CPRL_SMT2CPR3_MASK                             0x8
#define _SMT2CPRL_SMT2CPR4_POSN                             0x4
#define _SMT2CPRL_SMT2CPR4_POSITION                         0x4
#define _SMT2CPRL_SMT2CPR4_SIZE                             0x1
#define _SMT2CPRL_SMT2CPR4_LENGTH                           0x1
#define _SMT2CPRL_SMT2CPR4_MASK                             0x10
#define _SMT2CPRL_SMT2CPR5_POSN                             0x5
#define _SMT2CPRL_SMT2CPR5_POSITION                         0x5
#define _SMT2CPRL_SMT2CPR5_SIZE                             0x1
#define _SMT2CPRL_SMT2CPR5_LENGTH                           0x1
#define _SMT2CPRL_SMT2CPR5_MASK                             0x20
#define _SMT2CPRL_SMT2CPR6_POSN                             0x6
#define _SMT2CPRL_SMT2CPR6_POSITION                         0x6
#define _SMT2CPRL_SMT2CPR6_SIZE                             0x1
#define _SMT2CPRL_SMT2CPR6_LENGTH                           0x1
#define _SMT2CPRL_SMT2CPR6_MASK                             0x40
#define _SMT2CPRL_SMT2CPR7_POSN                             0x7
#define _SMT2CPRL_SMT2CPR7_POSITION                         0x7
#define _SMT2CPRL_SMT2CPR7_SIZE                             0x1
#define _SMT2CPRL_SMT2CPR7_LENGTH                           0x1
#define _SMT2CPRL_SMT2CPR7_MASK                             0x80

