MikroElektronika/core_packages/PIC/XC8/def/PIC18F66K40/mcu.h
// Register: CCPR5
#define CCPR5 CCPR5
extern volatile unsigned short          CCPR5               __at(0xF1C);
#ifndef _LIB_BUILD
asm("CCPR5 equ 0F1Ch");
#endif

// Register: CCPR5L
#define CCPR5L CCPR5L
extern volatile unsigned char           CCPR5L              __at(0xF1C);
#ifndef _LIB_BUILD
asm("CCPR5L equ 0F1Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RL                     :8;
    };
} CCPR5Lbits_t;
extern volatile CCPR5Lbits_t CCPR5Lbits __at(0xF1C);
// bitfield macros
#define _CCPR5L_RL_POSN                                     0x0
#define _CCPR5L_RL_POSITION                                 0x0
#define _CCPR5L_RL_SIZE                                     0x8
#define _CCPR5L_RL_LENGTH                                   0x8
#define _CCPR5L_RL_MASK                                     0xFF

// Register: CCPR5H
#define CCPR5H CCPR5H
extern volatile unsigned char           CCPR5H              __at(0xF1D);
#ifndef _LIB_BUILD
asm("CCPR5H equ 0F1Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RH                     :8;
    };
} CCPR5Hbits_t;
extern volatile CCPR5Hbits_t CCPR5Hbits __at(0xF1D);
// bitfield macros
#define _CCPR5H_RH_POSN                                     0x0
#define _CCPR5H_RH_POSITION                                 0x0
#define _CCPR5H_RH_SIZE                                     0x8
#define _CCPR5H_RH_LENGTH                                   0x8
#define _CCPR5H_RH_MASK                                     0xFF

// Register: CCP5CON
#define CCP5CON CCP5CON
extern volatile unsigned char           CCP5CON             __at(0xF1E);
#ifndef _LIB_BUILD
asm("CCP5CON equ 0F1Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE                   :4;
        unsigned FMT                    :1;
        unsigned OUT                    :1;
        unsigned OE                     :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
        unsigned MODE3                  :1;
    };
    struct {
        unsigned CCP5MODE               :4;
        unsigned CCP5FMT                :1;
        unsigned CCP5OUT                :1;
        unsigned CCP5OE                 :1;
        unsigned CCP5EN                 :1;
    };
    struct {
        unsigned CCP5MODE0              :1;
        unsigned CCP5MODE1              :1;
        unsigned CCP5MODE2              :1;
        unsigned CCP5MODE3              :1;
    };
} CCP5CONbits_t;
extern volatile CCP5CONbits_t CCP5CONbits __at(0xF1E);
// bitfield macros
#define _CCP5CON_MODE_POSN                                  0x0
#define _CCP5CON_MODE_POSITION                              0x0
#define _CCP5CON_MODE_SIZE                                  0x4
#define _CCP5CON_MODE_LENGTH                                0x4
#define _CCP5CON_MODE_MASK                                  0xF
#define _CCP5CON_FMT_POSN                                   0x4
#define _CCP5CON_FMT_POSITION                               0x4
#define _CCP5CON_FMT_SIZE                                   0x1
#define _CCP5CON_FMT_LENGTH                                 0x1
#define _CCP5CON_FMT_MASK                                   0x10
#define _CCP5CON_OUT_POSN                                   0x5
#define _CCP5CON_OUT_POSITION                               0x5
#define _CCP5CON_OUT_SIZE                                   0x1
#define _CCP5CON_OUT_LENGTH                                 0x1
#define _CCP5CON_OUT_MASK                                   0x20
#define _CCP5CON_OE_POSN                                    0x6
#define _CCP5CON_OE_POSITION                                0x6
#define _CCP5CON_OE_SIZE                                    0x1
#define _CCP5CON_OE_LENGTH                                  0x1
#define _CCP5CON_OE_MASK                                    0x40
#define _CCP5CON_EN_POSN                                    0x7
#define _CCP5CON_EN_POSITION                                0x7
#define _CCP5CON_EN_SIZE                                    0x1
#define _CCP5CON_EN_LENGTH                                  0x1
#define _CCP5CON_EN_MASK                                    0x80
#define _CCP5CON_MODE0_POSN                                 0x0
#define _CCP5CON_MODE0_POSITION                             0x0
#define _CCP5CON_MODE0_SIZE                                 0x1
#define _CCP5CON_MODE0_LENGTH                               0x1
#define _CCP5CON_MODE0_MASK                                 0x1
#define _CCP5CON_MODE1_POSN                                 0x1
#define _CCP5CON_MODE1_POSITION                             0x1
#define _CCP5CON_MODE1_SIZE                                 0x1
#define _CCP5CON_MODE1_LENGTH                               0x1
#define _CCP5CON_MODE1_MASK                                 0x2
#define _CCP5CON_MODE2_POSN                                 0x2
#define _CCP5CON_MODE2_POSITION                             0x2
#define _CCP5CON_MODE2_SIZE                                 0x1
#define _CCP5CON_MODE2_LENGTH                               0x1
#define _CCP5CON_MODE2_MASK                                 0x4
#define _CCP5CON_MODE3_POSN                                 0x3
#define _CCP5CON_MODE3_POSITION                             0x3
#define _CCP5CON_MODE3_SIZE                                 0x1
#define _CCP5CON_MODE3_LENGTH                               0x1
#define _CCP5CON_MODE3_MASK                                 0x8
#define _CCP5CON_CCP5MODE_POSN                              0x0
#define _CCP5CON_CCP5MODE_POSITION                          0x0
#define _CCP5CON_CCP5MODE_SIZE                              0x4
#define _CCP5CON_CCP5MODE_LENGTH                            0x4
#define _CCP5CON_CCP5MODE_MASK                              0xF
#define _CCP5CON_CCP5FMT_POSN                               0x4
#define _CCP5CON_CCP5FMT_POSITION                           0x4
#define _CCP5CON_CCP5FMT_SIZE                               0x1
#define _CCP5CON_CCP5FMT_LENGTH                             0x1
#define _CCP5CON_CCP5FMT_MASK                               0x10
#define _CCP5CON_CCP5OUT_POSN                               0x5
#define _CCP5CON_CCP5OUT_POSITION                           0x5
#define _CCP5CON_CCP5OUT_SIZE                               0x1
#define _CCP5CON_CCP5OUT_LENGTH                             0x1
#define _CCP5CON_CCP5OUT_MASK                               0x20
#define _CCP5CON_CCP5OE_POSN                                0x6
#define _CCP5CON_CCP5OE_POSITION                            0x6
#define _CCP5CON_CCP5OE_SIZE                                0x1
#define _CCP5CON_CCP5OE_LENGTH                              0x1
#define _CCP5CON_CCP5OE_MASK                                0x40
#define _CCP5CON_CCP5EN_POSN                                0x7
#define _CCP5CON_CCP5EN_POSITION                            0x7
#define _CCP5CON_CCP5EN_SIZE                                0x1
#define _CCP5CON_CCP5EN_LENGTH                              0x1
#define _CCP5CON_CCP5EN_MASK                                0x80
#define _CCP5CON_CCP5MODE0_POSN                             0x0
#define _CCP5CON_CCP5MODE0_POSITION                         0x0
#define _CCP5CON_CCP5MODE0_SIZE                             0x1
#define _CCP5CON_CCP5MODE0_LENGTH                           0x1
#define _CCP5CON_CCP5MODE0_MASK                             0x1
#define _CCP5CON_CCP5MODE1_POSN                             0x1
#define _CCP5CON_CCP5MODE1_POSITION                         0x1
#define _CCP5CON_CCP5MODE1_SIZE                             0x1
#define _CCP5CON_CCP5MODE1_LENGTH                           0x1
#define _CCP5CON_CCP5MODE1_MASK                             0x2
#define _CCP5CON_CCP5MODE2_POSN                             0x2
#define _CCP5CON_CCP5MODE2_POSITION                         0x2
#define _CCP5CON_CCP5MODE2_SIZE                             0x1
#define _CCP5CON_CCP5MODE2_LENGTH                           0x1
#define _CCP5CON_CCP5MODE2_MASK                             0x4
#define _CCP5CON_CCP5MODE3_POSN                             0x3
#define _CCP5CON_CCP5MODE3_POSITION                         0x3
#define _CCP5CON_CCP5MODE3_SIZE                             0x1
#define _CCP5CON_CCP5MODE3_LENGTH                           0x1
#define _CCP5CON_CCP5MODE3_MASK                             0x8

// Register: CCP5CAP
#define CCP5CAP CCP5CAP
extern volatile unsigned char           CCP5CAP             __at(0xF1F);
#ifndef _LIB_BUILD
asm("CCP5CAP equ 0F1Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CTS                    :8;
    };
    struct {
        unsigned CTS0                   :1;
        unsigned CTS1                   :1;
        unsigned CTS2                   :1;
        unsigned CTS3                   :1;
        unsigned CTS4                   :1;
        unsigned CTS5                   :1;
        unsigned CTS6                   :1;
        unsigned CTS7                   :1;
    };
    struct {
        unsigned CCP5CTS                :8;
    };
    struct {
        unsigned CCP5CTS0               :1;
        unsigned CCP5CTS1               :1;
        unsigned CCP5CTS2               :1;
        unsigned CCP5CTS3               :1;
        unsigned CCP5CTS4               :1;
        unsigned CCP5CTS5               :1;
        unsigned CCP5CTS6               :1;
        unsigned CCP5CTS7               :1;
    };
} CCP5CAPbits_t;
extern volatile CCP5CAPbits_t CCP5CAPbits __at(0xF1F);
// bitfield macros
#define _CCP5CAP_CTS_POSN                                   0x0
#define _CCP5CAP_CTS_POSITION                               0x0
#define _CCP5CAP_CTS_SIZE                                   0x8
#define _CCP5CAP_CTS_LENGTH                                 0x8
#define _CCP5CAP_CTS_MASK                                   0xFF
#define _CCP5CAP_CTS0_POSN                                  0x0
#define _CCP5CAP_CTS0_POSITION                              0x0
#define _CCP5CAP_CTS0_SIZE                                  0x1
#define _CCP5CAP_CTS0_LENGTH                                0x1
#define _CCP5CAP_CTS0_MASK                                  0x1
#define _CCP5CAP_CTS1_POSN                                  0x1
#define _CCP5CAP_CTS1_POSITION                              0x1
#define _CCP5CAP_CTS1_SIZE                                  0x1
#define _CCP5CAP_CTS1_LENGTH                                0x1
#define _CCP5CAP_CTS1_MASK                                  0x2
#define _CCP5CAP_CTS2_POSN                                  0x2
#define _CCP5CAP_CTS2_POSITION                              0x2
#define _CCP5CAP_CTS2_SIZE                                  0x1
#define _CCP5CAP_CTS2_LENGTH                                0x1
#define _CCP5CAP_CTS2_MASK                                  0x4
#define _CCP5CAP_CTS3_POSN                                  0x3
#define _CCP5CAP_CTS3_POSITION                              0x3
#define _CCP5CAP_CTS3_SIZE                                  0x1
#define _CCP5CAP_CTS3_LENGTH                                0x1
#define _CCP5CAP_CTS3_MASK                                  0x8
#define _CCP5CAP_CTS4_POSN                                  0x4
#define _CCP5CAP_CTS4_POSITION                              0x4
#define _CCP5CAP_CTS4_SIZE                                  0x1
#define _CCP5CAP_CTS4_LENGTH                                0x1
#define _CCP5CAP_CTS4_MASK                                  0x10
#define _CCP5CAP_CTS5_POSN                                  0x5
#define _CCP5CAP_CTS5_POSITION                              0x5
#define _CCP5CAP_CTS5_SIZE                                  0x1
#define _CCP5CAP_CTS5_LENGTH                                0x1
#define _CCP5CAP_CTS5_MASK                                  0x20
#define _CCP5CAP_CTS6_POSN                                  0x6
#define _CCP5CAP_CTS6_POSITION                              0x6
#define _CCP5CAP_CTS6_SIZE                                  0x1
#define _CCP5CAP_CTS6_LENGTH                                0x1
#define _CCP5CAP_CTS6_MASK                                  0x40
#define _CCP5CAP_CTS7_POSN                                  0x7
#define _CCP5CAP_CTS7_POSITION                              0x7
#define _CCP5CAP_CTS7_SIZE                                  0x1
#define _CCP5CAP_CTS7_LENGTH                                0x1
#define _CCP5CAP_CTS7_MASK                                  0x80
#define _CCP5CAP_CCP5CTS_POSN                               0x0
#define _CCP5CAP_CCP5CTS_POSITION                           0x0
#define _CCP5CAP_CCP5CTS_SIZE                               0x8
#define _CCP5CAP_CCP5CTS_LENGTH                             0x8
#define _CCP5CAP_CCP5CTS_MASK                               0xFF
#define _CCP5CAP_CCP5CTS0_POSN                              0x0
#define _CCP5CAP_CCP5CTS0_POSITION                          0x0
#define _CCP5CAP_CCP5CTS0_SIZE                              0x1
#define _CCP5CAP_CCP5CTS0_LENGTH                            0x1
#define _CCP5CAP_CCP5CTS0_MASK                              0x1
#define _CCP5CAP_CCP5CTS1_POSN                              0x1
#define _CCP5CAP_CCP5CTS1_POSITION                          0x1
#define _CCP5CAP_CCP5CTS1_SIZE                              0x1
#define _CCP5CAP_CCP5CTS1_LENGTH                            0x1
#define _CCP5CAP_CCP5CTS1_MASK                              0x2
#define _CCP5CAP_CCP5CTS2_POSN                              0x2
#define _CCP5CAP_CCP5CTS2_POSITION                          0x2
#define _CCP5CAP_CCP5CTS2_SIZE                              0x1
#define _CCP5CAP_CCP5CTS2_LENGTH                            0x1
#define _CCP5CAP_CCP5CTS2_MASK                              0x4
#define _CCP5CAP_CCP5CTS3_POSN                              0x3
#define _CCP5CAP_CCP5CTS3_POSITION                          0x3
#define _CCP5CAP_CCP5CTS3_SIZE                              0x1
#define _CCP5CAP_CCP5CTS3_LENGTH                            0x1
#define _CCP5CAP_CCP5CTS3_MASK                              0x8
#define _CCP5CAP_CCP5CTS4_POSN                              0x4
#define _CCP5CAP_CCP5CTS4_POSITION                          0x4
#define _CCP5CAP_CCP5CTS4_SIZE                              0x1
#define _CCP5CAP_CCP5CTS4_LENGTH                            0x1
#define _CCP5CAP_CCP5CTS4_MASK                              0x10
#define _CCP5CAP_CCP5CTS5_POSN                              0x5
#define _CCP5CAP_CCP5CTS5_POSITION                          0x5
#define _CCP5CAP_CCP5CTS5_SIZE                              0x1
#define _CCP5CAP_CCP5CTS5_LENGTH                            0x1
#define _CCP5CAP_CCP5CTS5_MASK                              0x20
#define _CCP5CAP_CCP5CTS6_POSN                              0x6
#define _CCP5CAP_CCP5CTS6_POSITION                          0x6
#define _CCP5CAP_CCP5CTS6_SIZE                              0x1
#define _CCP5CAP_CCP5CTS6_LENGTH                            0x1
#define _CCP5CAP_CCP5CTS6_MASK                              0x40
#define _CCP5CAP_CCP5CTS7_POSN                              0x7
#define _CCP5CAP_CCP5CTS7_POSITION                          0x7
#define _CCP5CAP_CCP5CTS7_SIZE                              0x1
#define _CCP5CAP_CCP5CTS7_LENGTH                            0x1
#define _CCP5CAP_CCP5CTS7_MASK                              0x80

// Register: CCPR4
#define CCPR4 CCPR4
extern volatile unsigned short          CCPR4               __at(0xF20);
#ifndef _LIB_BUILD
asm("CCPR4 equ 0F20h");
#endif

// Register: CCPR4L
#define CCPR4L CCPR4L
extern volatile unsigned char           CCPR4L              __at(0xF20);
#ifndef _LIB_BUILD
asm("CCPR4L equ 0F20h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RL                     :8;
    };
} CCPR4Lbits_t;
extern volatile CCPR4Lbits_t CCPR4Lbits __at(0xF20);
// bitfield macros
#define _CCPR4L_RL_POSN                                     0x0
#define _CCPR4L_RL_POSITION                                 0x0
#define _CCPR4L_RL_SIZE                                     0x8
#define _CCPR4L_RL_LENGTH                                   0x8
#define _CCPR4L_RL_MASK                                     0xFF

// Register: CCPR4H
#define CCPR4H CCPR4H
extern volatile unsigned char           CCPR4H              __at(0xF21);
#ifndef _LIB_BUILD
asm("CCPR4H equ 0F21h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RH                     :8;
    };
} CCPR4Hbits_t;
extern volatile CCPR4Hbits_t CCPR4Hbits __at(0xF21);
// bitfield macros
#define _CCPR4H_RH_POSN                                     0x0
#define _CCPR4H_RH_POSITION                                 0x0
#define _CCPR4H_RH_SIZE                                     0x8
#define _CCPR4H_RH_LENGTH                                   0x8
#define _CCPR4H_RH_MASK                                     0xFF

// Register: CCP4CON
#define CCP4CON CCP4CON
extern volatile unsigned char           CCP4CON             __at(0xF22);
#ifndef _LIB_BUILD
asm("CCP4CON equ 0F22h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE                   :4;
        unsigned FMT                    :1;
        unsigned OUT                    :1;
        unsigned OE                     :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
        unsigned MODE3                  :1;
    };
    struct {
        unsigned CCP4MODE               :4;
        unsigned CCP4FMT                :1;
        unsigned CCP4OUT                :1;
        unsigned CCP4OE                 :1;
        unsigned CCP4EN                 :1;
    };
    struct {
        unsigned CCP4MODE0              :1;
        unsigned CCP4MODE1              :1;
        unsigned CCP4MODE2              :1;
        unsigned CCP4MODE3              :1;
    };
} CCP4CONbits_t;
extern volatile CCP4CONbits_t CCP4CONbits __at(0xF22);
// bitfield macros
#define _CCP4CON_MODE_POSN                                  0x0
#define _CCP4CON_MODE_POSITION                              0x0
#define _CCP4CON_MODE_SIZE                                  0x4
#define _CCP4CON_MODE_LENGTH                                0x4
#define _CCP4CON_MODE_MASK                                  0xF
#define _CCP4CON_FMT_POSN                                   0x4
#define _CCP4CON_FMT_POSITION                               0x4
#define _CCP4CON_FMT_SIZE                                   0x1
#define _CCP4CON_FMT_LENGTH                                 0x1
#define _CCP4CON_FMT_MASK                                   0x10
#define _CCP4CON_OUT_POSN                                   0x5
#define _CCP4CON_OUT_POSITION                               0x5
#define _CCP4CON_OUT_SIZE                                   0x1
#define _CCP4CON_OUT_LENGTH                                 0x1
#define _CCP4CON_OUT_MASK                                   0x20
#define _CCP4CON_OE_POSN                                    0x6
#define _CCP4CON_OE_POSITION                                0x6
#define _CCP4CON_OE_SIZE                                    0x1
#define _CCP4CON_OE_LENGTH                                  0x1
#define _CCP4CON_OE_MASK                                    0x40
#define _CCP4CON_EN_POSN                                    0x7
#define _CCP4CON_EN_POSITION                                0x7
#define _CCP4CON_EN_SIZE                                    0x1
#define _CCP4CON_EN_LENGTH                                  0x1
#define _CCP4CON_EN_MASK                                    0x80
#define _CCP4CON_MODE0_POSN                                 0x0
#define _CCP4CON_MODE0_POSITION                             0x0
#define _CCP4CON_MODE0_SIZE                                 0x1
#define _CCP4CON_MODE0_LENGTH                               0x1
#define _CCP4CON_MODE0_MASK                                 0x1
#define _CCP4CON_MODE1_POSN                                 0x1
#define _CCP4CON_MODE1_POSITION                             0x1
#define _CCP4CON_MODE1_SIZE                                 0x1
#define _CCP4CON_MODE1_LENGTH                               0x1
#define _CCP4CON_MODE1_MASK                                 0x2
#define _CCP4CON_MODE2_POSN                                 0x2
#define _CCP4CON_MODE2_POSITION                             0x2
#define _CCP4CON_MODE2_SIZE                                 0x1
#define _CCP4CON_MODE2_LENGTH                               0x1
#define _CCP4CON_MODE2_MASK                                 0x4
#define _CCP4CON_MODE3_POSN                                 0x3
#define _CCP4CON_MODE3_POSITION                             0x3
#define _CCP4CON_MODE3_SIZE                                 0x1
#define _CCP4CON_MODE3_LENGTH                               0x1
#define _CCP4CON_MODE3_MASK                                 0x8
#define _CCP4CON_CCP4MODE_POSN                              0x0
#define _CCP4CON_CCP4MODE_POSITION                          0x0
#define _CCP4CON_CCP4MODE_SIZE                              0x4
#define _CCP4CON_CCP4MODE_LENGTH                            0x4
#define _CCP4CON_CCP4MODE_MASK                              0xF
#define _CCP4CON_CCP4FMT_POSN                               0x4
#define _CCP4CON_CCP4FMT_POSITION                           0x4
#define _CCP4CON_CCP4FMT_SIZE                               0x1
#define _CCP4CON_CCP4FMT_LENGTH                             0x1
#define _CCP4CON_CCP4FMT_MASK                               0x10
#define _CCP4CON_CCP4OUT_POSN                               0x5
#define _CCP4CON_CCP4OUT_POSITION                           0x5
#define _CCP4CON_CCP4OUT_SIZE                               0x1
#define _CCP4CON_CCP4OUT_LENGTH                             0x1
#define _CCP4CON_CCP4OUT_MASK                               0x20
#define _CCP4CON_CCP4OE_POSN                                0x6
#define _CCP4CON_CCP4OE_POSITION                            0x6
#define _CCP4CON_CCP4OE_SIZE                                0x1
#define _CCP4CON_CCP4OE_LENGTH                              0x1
#define _CCP4CON_CCP4OE_MASK                                0x40
#define _CCP4CON_CCP4EN_POSN                                0x7
#define _CCP4CON_CCP4EN_POSITION                            0x7
#define _CCP4CON_CCP4EN_SIZE                                0x1
#define _CCP4CON_CCP4EN_LENGTH                              0x1
#define _CCP4CON_CCP4EN_MASK                                0x80
#define _CCP4CON_CCP4MODE0_POSN                             0x0
#define _CCP4CON_CCP4MODE0_POSITION                         0x0
#define _CCP4CON_CCP4MODE0_SIZE                             0x1
#define _CCP4CON_CCP4MODE0_LENGTH                           0x1
#define _CCP4CON_CCP4MODE0_MASK                             0x1
#define _CCP4CON_CCP4MODE1_POSN                             0x1
#define _CCP4CON_CCP4MODE1_POSITION                         0x1
#define _CCP4CON_CCP4MODE1_SIZE                             0x1
#define _CCP4CON_CCP4MODE1_LENGTH                           0x1
#define _CCP4CON_CCP4MODE1_MASK                             0x2
#define _CCP4CON_CCP4MODE2_POSN                             0x2
#define _CCP4CON_CCP4MODE2_POSITION                         0x2
#define _CCP4CON_CCP4MODE2_SIZE                             0x1
#define _CCP4CON_CCP4MODE2_LENGTH                           0x1
#define _CCP4CON_CCP4MODE2_MASK                             0x4
#define _CCP4CON_CCP4MODE3_POSN                             0x3
#define _CCP4CON_CCP4MODE3_POSITION                         0x3
#define _CCP4CON_CCP4MODE3_SIZE                             0x1
#define _CCP4CON_CCP4MODE3_LENGTH                           0x1
#define _CCP4CON_CCP4MODE3_MASK                             0x8

