MikroElektronika/core_packages/PIC/XC8/def/PIC18F66K40/mcu.h
// Register: TMR7H
#define TMR7H TMR7H
extern volatile unsigned char           TMR7H               __at(0xF2F);
#ifndef _LIB_BUILD
asm("TMR7H equ 0F2Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR7H0                 :1;
        unsigned TMR7H1                 :1;
        unsigned TMR7H2                 :1;
        unsigned TMR7H3                 :1;
        unsigned TMR7H4                 :1;
        unsigned TMR7H5                 :1;
        unsigned TMR7H6                 :1;
        unsigned TMR7H7                 :1;
    };
    struct {
        unsigned TMR7H                  :8;
    };
    struct {
        unsigned TMR78                  :1;
        unsigned TMR79                  :1;
        unsigned TMR710                 :1;
        unsigned TMR711                 :1;
        unsigned TMR712                 :1;
        unsigned TMR713                 :1;
        unsigned TMR714                 :1;
        unsigned TMR715                 :1;
    };
} TMR7Hbits_t;
extern volatile TMR7Hbits_t TMR7Hbits __at(0xF2F);
// bitfield macros
#define _TMR7H_TMR7H0_POSN                                  0x0
#define _TMR7H_TMR7H0_POSITION                              0x0
#define _TMR7H_TMR7H0_SIZE                                  0x1
#define _TMR7H_TMR7H0_LENGTH                                0x1
#define _TMR7H_TMR7H0_MASK                                  0x1
#define _TMR7H_TMR7H1_POSN                                  0x1
#define _TMR7H_TMR7H1_POSITION                              0x1
#define _TMR7H_TMR7H1_SIZE                                  0x1
#define _TMR7H_TMR7H1_LENGTH                                0x1
#define _TMR7H_TMR7H1_MASK                                  0x2
#define _TMR7H_TMR7H2_POSN                                  0x2
#define _TMR7H_TMR7H2_POSITION                              0x2
#define _TMR7H_TMR7H2_SIZE                                  0x1
#define _TMR7H_TMR7H2_LENGTH                                0x1
#define _TMR7H_TMR7H2_MASK                                  0x4
#define _TMR7H_TMR7H3_POSN                                  0x3
#define _TMR7H_TMR7H3_POSITION                              0x3
#define _TMR7H_TMR7H3_SIZE                                  0x1
#define _TMR7H_TMR7H3_LENGTH                                0x1
#define _TMR7H_TMR7H3_MASK                                  0x8
#define _TMR7H_TMR7H4_POSN                                  0x4
#define _TMR7H_TMR7H4_POSITION                              0x4
#define _TMR7H_TMR7H4_SIZE                                  0x1
#define _TMR7H_TMR7H4_LENGTH                                0x1
#define _TMR7H_TMR7H4_MASK                                  0x10
#define _TMR7H_TMR7H5_POSN                                  0x5
#define _TMR7H_TMR7H5_POSITION                              0x5
#define _TMR7H_TMR7H5_SIZE                                  0x1
#define _TMR7H_TMR7H5_LENGTH                                0x1
#define _TMR7H_TMR7H5_MASK                                  0x20
#define _TMR7H_TMR7H6_POSN                                  0x6
#define _TMR7H_TMR7H6_POSITION                              0x6
#define _TMR7H_TMR7H6_SIZE                                  0x1
#define _TMR7H_TMR7H6_LENGTH                                0x1
#define _TMR7H_TMR7H6_MASK                                  0x40
#define _TMR7H_TMR7H7_POSN                                  0x7
#define _TMR7H_TMR7H7_POSITION                              0x7
#define _TMR7H_TMR7H7_SIZE                                  0x1
#define _TMR7H_TMR7H7_LENGTH                                0x1
#define _TMR7H_TMR7H7_MASK                                  0x80
#define _TMR7H_TMR7H_POSN                                   0x0
#define _TMR7H_TMR7H_POSITION                               0x0
#define _TMR7H_TMR7H_SIZE                                   0x8
#define _TMR7H_TMR7H_LENGTH                                 0x8
#define _TMR7H_TMR7H_MASK                                   0xFF
#define _TMR7H_TMR78_POSN                                   0x0
#define _TMR7H_TMR78_POSITION                               0x0
#define _TMR7H_TMR78_SIZE                                   0x1
#define _TMR7H_TMR78_LENGTH                                 0x1
#define _TMR7H_TMR78_MASK                                   0x1
#define _TMR7H_TMR79_POSN                                   0x1
#define _TMR7H_TMR79_POSITION                               0x1
#define _TMR7H_TMR79_SIZE                                   0x1
#define _TMR7H_TMR79_LENGTH                                 0x1
#define _TMR7H_TMR79_MASK                                   0x2
#define _TMR7H_TMR710_POSN                                  0x2
#define _TMR7H_TMR710_POSITION                              0x2
#define _TMR7H_TMR710_SIZE                                  0x1
#define _TMR7H_TMR710_LENGTH                                0x1
#define _TMR7H_TMR710_MASK                                  0x4
#define _TMR7H_TMR711_POSN                                  0x3
#define _TMR7H_TMR711_POSITION                              0x3
#define _TMR7H_TMR711_SIZE                                  0x1
#define _TMR7H_TMR711_LENGTH                                0x1
#define _TMR7H_TMR711_MASK                                  0x8
#define _TMR7H_TMR712_POSN                                  0x4
#define _TMR7H_TMR712_POSITION                              0x4
#define _TMR7H_TMR712_SIZE                                  0x1
#define _TMR7H_TMR712_LENGTH                                0x1
#define _TMR7H_TMR712_MASK                                  0x10
#define _TMR7H_TMR713_POSN                                  0x5
#define _TMR7H_TMR713_POSITION                              0x5
#define _TMR7H_TMR713_SIZE                                  0x1
#define _TMR7H_TMR713_LENGTH                                0x1
#define _TMR7H_TMR713_MASK                                  0x20
#define _TMR7H_TMR714_POSN                                  0x6
#define _TMR7H_TMR714_POSITION                              0x6
#define _TMR7H_TMR714_SIZE                                  0x1
#define _TMR7H_TMR714_LENGTH                                0x1
#define _TMR7H_TMR714_MASK                                  0x40
#define _TMR7H_TMR715_POSN                                  0x7
#define _TMR7H_TMR715_POSITION                              0x7
#define _TMR7H_TMR715_SIZE                                  0x1
#define _TMR7H_TMR715_LENGTH                                0x1
#define _TMR7H_TMR715_MASK                                  0x80

