MikroElektronika/core_packages/PIC/XC8/def/PIC18F66K40/mcu.h
extern volatile __bit                   INLVLD1             __at(0x7519);	// @ (0xEA3 * 8 + 1)
#define                                 INLVLD1_bit         _BIT_ACCESS(INLVLD,1)
// INLVLD<INLVLD2>
extern volatile __bit                   INLVLD2             __at(0x751A);	// @ (0xEA3 * 8 + 2)
#define                                 INLVLD2_bit         _BIT_ACCESS(INLVLD,2)
// INLVLD<INLVLD3>
extern volatile __bit                   INLVLD3             __at(0x751B);	// @ (0xEA3 * 8 + 3)
#define                                 INLVLD3_bit         _BIT_ACCESS(INLVLD,3)
// INLVLD<INLVLD4>
extern volatile __bit                   INLVLD4             __at(0x751C);	// @ (0xEA3 * 8 + 4)
#define                                 INLVLD4_bit         _BIT_ACCESS(INLVLD,4)
// INLVLD<INLVLD5>
extern volatile __bit                   INLVLD5             __at(0x751D);	// @ (0xEA3 * 8 + 5)
#define                                 INLVLD5_bit         _BIT_ACCESS(INLVLD,5)
// INLVLD<INLVLD6>
extern volatile __bit                   INLVLD6             __at(0x751E);	// @ (0xEA3 * 8 + 6)
#define                                 INLVLD6_bit         _BIT_ACCESS(INLVLD,6)
// INLVLD<INLVLD7>
extern volatile __bit                   INLVLD7             __at(0x751F);	// @ (0xEA3 * 8 + 7)
#define                                 INLVLD7_bit         _BIT_ACCESS(INLVLD,7)
// INLVLE<INLVLE0>
extern volatile __bit                   INLVLE0             __at(0x7558);	// @ (0xEAB * 8 + 0)
#define                                 INLVLE0_bit         _BIT_ACCESS(INLVLE,0)
// INLVLE<INLVLE1>
extern volatile __bit                   INLVLE1             __at(0x7559);	// @ (0xEAB * 8 + 1)
#define                                 INLVLE1_bit         _BIT_ACCESS(INLVLE,1)
// INLVLE<INLVLE2>
extern volatile __bit                   INLVLE2             __at(0x755A);	// @ (0xEAB * 8 + 2)
#define                                 INLVLE2_bit         _BIT_ACCESS(INLVLE,2)
// INLVLE<INLVLE3>
extern volatile __bit                   INLVLE3             __at(0x755B);	// @ (0xEAB * 8 + 3)
#define                                 INLVLE3_bit         _BIT_ACCESS(INLVLE,3)
// INLVLE<INLVLE4>
extern volatile __bit                   INLVLE4             __at(0x755C);	// @ (0xEAB * 8 + 4)
#define                                 INLVLE4_bit         _BIT_ACCESS(INLVLE,4)
// INLVLE<INLVLE5>
extern volatile __bit                   INLVLE5             __at(0x755D);	// @ (0xEAB * 8 + 5)
#define                                 INLVLE5_bit         _BIT_ACCESS(INLVLE,5)
// INLVLE<INLVLE6>
extern volatile __bit                   INLVLE6             __at(0x755E);	// @ (0xEAB * 8 + 6)
#define                                 INLVLE6_bit         _BIT_ACCESS(INLVLE,6)
// INLVLE<INLVLE7>
extern volatile __bit                   INLVLE7             __at(0x755F);	// @ (0xEAB * 8 + 7)
#define                                 INLVLE7_bit         _BIT_ACCESS(INLVLE,7)
// INLVLF<INLVLF0>
extern volatile __bit                   INLVLF0             __at(0x7580);	// @ (0xEB0 * 8 + 0)
#define                                 INLVLF0_bit         _BIT_ACCESS(INLVLF,0)
// INLVLF<INLVLF1>
extern volatile __bit                   INLVLF1             __at(0x7581);	// @ (0xEB0 * 8 + 1)
#define                                 INLVLF1_bit         _BIT_ACCESS(INLVLF,1)
// INLVLF<INLVLF2>
extern volatile __bit                   INLVLF2             __at(0x7582);	// @ (0xEB0 * 8 + 2)
#define                                 INLVLF2_bit         _BIT_ACCESS(INLVLF,2)
// INLVLF<INLVLF3>
extern volatile __bit                   INLVLF3             __at(0x7583);	// @ (0xEB0 * 8 + 3)
#define                                 INLVLF3_bit         _BIT_ACCESS(INLVLF,3)
// INLVLF<INLVLF4>
extern volatile __bit                   INLVLF4             __at(0x7584);	// @ (0xEB0 * 8 + 4)
#define                                 INLVLF4_bit         _BIT_ACCESS(INLVLF,4)
// INLVLF<INLVLF5>
extern volatile __bit                   INLVLF5             __at(0x7585);	// @ (0xEB0 * 8 + 5)
#define                                 INLVLF5_bit         _BIT_ACCESS(INLVLF,5)
// INLVLF<INLVLF6>
extern volatile __bit                   INLVLF6             __at(0x7586);	// @ (0xEB0 * 8 + 6)
#define                                 INLVLF6_bit         _BIT_ACCESS(INLVLF,6)
// INLVLF<INLVLF7>
extern volatile __bit                   INLVLF7             __at(0x7587);	// @ (0xEB0 * 8 + 7)
#define                                 INLVLF7_bit         _BIT_ACCESS(INLVLF,7)
// INLVLG<INLVLG0>
extern volatile __bit                   INLVLG0             __at(0x75C0);	// @ (0xEB8 * 8 + 0)
#define                                 INLVLG0_bit         _BIT_ACCESS(INLVLG,0)
// INLVLG<INLVLG1>
extern volatile __bit                   INLVLG1             __at(0x75C1);	// @ (0xEB8 * 8 + 1)
#define                                 INLVLG1_bit         _BIT_ACCESS(INLVLG,1)
// INLVLG<INLVLG2>
extern volatile __bit                   INLVLG2             __at(0x75C2);	// @ (0xEB8 * 8 + 2)
#define                                 INLVLG2_bit         _BIT_ACCESS(INLVLG,2)
// INLVLG<INLVLG3>
extern volatile __bit                   INLVLG3             __at(0x75C3);	// @ (0xEB8 * 8 + 3)
#define                                 INLVLG3_bit         _BIT_ACCESS(INLVLG,3)
// INLVLG<INLVLG4>
extern volatile __bit                   INLVLG4             __at(0x75C4);	// @ (0xEB8 * 8 + 4)
#define                                 INLVLG4_bit         _BIT_ACCESS(INLVLG,4)
// INLVLG<INLVLG5>
extern volatile __bit                   INLVLG5             __at(0x75C5);	// @ (0xEB8 * 8 + 5)
#define                                 INLVLG5_bit         _BIT_ACCESS(INLVLG,5)
// INLVLG<INLVLG6>
extern volatile __bit                   INLVLG6             __at(0x75C6);	// @ (0xEB8 * 8 + 6)
#define                                 INLVLG6_bit         _BIT_ACCESS(INLVLG,6)
// INLVLG<INLVLG7>
extern volatile __bit                   INLVLG7             __at(0x75C7);	// @ (0xEB8 * 8 + 7)
#define                                 INLVLG7_bit         _BIT_ACCESS(INLVLG,7)
// INLVLH<INLVLH0>
extern volatile __bit                   INLVLH0             __at(0x75E8);	// @ (0xEBD * 8 + 0)
#define                                 INLVLH0_bit         _BIT_ACCESS(INLVLH,0)
// INLVLH<INLVLH1>
extern volatile __bit                   INLVLH1             __at(0x75E9);	// @ (0xEBD * 8 + 1)
#define                                 INLVLH1_bit         _BIT_ACCESS(INLVLH,1)
// INLVLH<INLVLH2>
extern volatile __bit                   INLVLH2             __at(0x75EA);	// @ (0xEBD * 8 + 2)
#define                                 INLVLH2_bit         _BIT_ACCESS(INLVLH,2)
// INLVLH<INLVLH3>
extern volatile __bit                   INLVLH3             __at(0x75EB);	// @ (0xEBD * 8 + 3)
#define                                 INLVLH3_bit         _BIT_ACCESS(INLVLH,3)
// INTCON<INT0EDG>
extern volatile __bit                   INT0EDG             __at(0x7F90);	// @ (0xFF2 * 8 + 0)
#define                                 INT0EDG_bit         _BIT_ACCESS(INTCON,0)
// PIE0<INT0IE>
extern volatile __bit                   INT0IE              __at(0x7148);	// @ (0xE29 * 8 + 0)
#define                                 INT0IE_bit          _BIT_ACCESS(PIE0,0)
// PIR0<INT0IF>
extern volatile __bit                   INT0IF              __at(0x7198);	// @ (0xE33 * 8 + 0)
#define                                 INT0IF_bit          _BIT_ACCESS(PIR0,0)
// IPR0<INT0IP>
extern volatile __bit                   INT0IP              __at(0x70F8);	// @ (0xE1F * 8 + 0)
#define                                 INT0IP_bit          _BIT_ACCESS(IPR0,0)
// INT0PPS<INT0PPS0>
extern volatile __bit                   INT0PPS0            __at(0x6F80);	// @ (0xDF0 * 8 + 0)
#define                                 INT0PPS0_bit        _BIT_ACCESS(INT0PPS,0)
// INT0PPS<INT0PPS1>
extern volatile __bit                   INT0PPS1            __at(0x6F81);	// @ (0xDF0 * 8 + 1)
#define                                 INT0PPS1_bit        _BIT_ACCESS(INT0PPS,1)
// INT0PPS<INT0PPS2>
extern volatile __bit                   INT0PPS2            __at(0x6F82);	// @ (0xDF0 * 8 + 2)
#define                                 INT0PPS2_bit        _BIT_ACCESS(INT0PPS,2)
// INT0PPS<INT0PPS3>
extern volatile __bit                   INT0PPS3            __at(0x6F83);	// @ (0xDF0 * 8 + 3)
#define                                 INT0PPS3_bit        _BIT_ACCESS(INT0PPS,3)
// INTCON<INT1EDG>
extern volatile __bit                   INT1EDG             __at(0x7F91);	// @ (0xFF2 * 8 + 1)
#define                                 INT1EDG_bit         _BIT_ACCESS(INTCON,1)
// PIE0<INT1IE>
extern volatile __bit                   INT1IE              __at(0x7149);	// @ (0xE29 * 8 + 1)
#define                                 INT1IE_bit          _BIT_ACCESS(PIE0,1)
// PIR0<INT1IF>
extern volatile __bit                   INT1IF              __at(0x7199);	// @ (0xE33 * 8 + 1)
#define                                 INT1IF_bit          _BIT_ACCESS(PIR0,1)
// IPR0<INT1IP>
extern volatile __bit                   INT1IP              __at(0x70F9);	// @ (0xE1F * 8 + 1)
#define                                 INT1IP_bit          _BIT_ACCESS(IPR0,1)
// INT1PPS<INT1PPS0>
extern volatile __bit                   INT1PPS0            __at(0x6F88);	// @ (0xDF1 * 8 + 0)
#define                                 INT1PPS0_bit        _BIT_ACCESS(INT1PPS,0)
// INT1PPS<INT1PPS1>
extern volatile __bit                   INT1PPS1            __at(0x6F89);	// @ (0xDF1 * 8 + 1)
#define                                 INT1PPS1_bit        _BIT_ACCESS(INT1PPS,1)
// INT1PPS<INT1PPS2>
extern volatile __bit                   INT1PPS2            __at(0x6F8A);	// @ (0xDF1 * 8 + 2)
#define                                 INT1PPS2_bit        _BIT_ACCESS(INT1PPS,2)
// INT1PPS<INT1PPS3>
extern volatile __bit                   INT1PPS3            __at(0x6F8B);	// @ (0xDF1 * 8 + 3)
#define                                 INT1PPS3_bit        _BIT_ACCESS(INT1PPS,3)
// INT1PPS<INT1PPS4>
extern volatile __bit                   INT1PPS4            __at(0x6F8C);	// @ (0xDF1 * 8 + 4)
#define                                 INT1PPS4_bit        _BIT_ACCESS(INT1PPS,4)
// INTCON<INT2EDG>
extern volatile __bit                   INT2EDG             __at(0x7F92);	// @ (0xFF2 * 8 + 2)
#define                                 INT2EDG_bit         _BIT_ACCESS(INTCON,2)
// PIE0<INT2IE>
extern volatile __bit                   INT2IE              __at(0x714A);	// @ (0xE29 * 8 + 2)
#define                                 INT2IE_bit          _BIT_ACCESS(PIE0,2)
// PIR0<INT2IF>
extern volatile __bit                   INT2IF              __at(0x719A);	// @ (0xE33 * 8 + 2)
#define                                 INT2IF_bit          _BIT_ACCESS(PIR0,2)
// IPR0<INT2IP>
extern volatile __bit                   INT2IP              __at(0x70FA);	// @ (0xE1F * 8 + 2)
#define                                 INT2IP_bit          _BIT_ACCESS(IPR0,2)
// INT2PPS<INT2PPS0>
extern volatile __bit                   INT2PPS0            __at(0x6F90);	// @ (0xDF2 * 8 + 0)
#define                                 INT2PPS0_bit        _BIT_ACCESS(INT2PPS,0)
// INT2PPS<INT2PPS1>
extern volatile __bit                   INT2PPS1            __at(0x6F91);	// @ (0xDF2 * 8 + 1)
#define                                 INT2PPS1_bit        _BIT_ACCESS(INT2PPS,1)
// INT2PPS<INT2PPS2>
extern volatile __bit                   INT2PPS2            __at(0x6F92);	// @ (0xDF2 * 8 + 2)
#define                                 INT2PPS2_bit        _BIT_ACCESS(INT2PPS,2)
// INT2PPS<INT2PPS3>
extern volatile __bit                   INT2PPS3            __at(0x6F93);	// @ (0xDF2 * 8 + 3)
#define                                 INT2PPS3_bit        _BIT_ACCESS(INT2PPS,3)
// INT2PPS<INT2PPS4>
extern volatile __bit                   INT2PPS4            __at(0x6F94);	// @ (0xDF2 * 8 + 4)
#define                                 INT2PPS4_bit        _BIT_ACCESS(INT2PPS,4)
// INTCON<INT3EDG>
extern volatile __bit                   INT3EDG             __at(0x7F93);	// @ (0xFF2 * 8 + 3)
#define                                 INT3EDG_bit         _BIT_ACCESS(INTCON,3)
// PIE0<INT3IE>
extern volatile __bit                   INT3IE              __at(0x714B);	// @ (0xE29 * 8 + 3)
#define                                 INT3IE_bit          _BIT_ACCESS(PIE0,3)
// PIR0<INT3IF>
extern volatile __bit                   INT3IF              __at(0x719B);	// @ (0xE33 * 8 + 3)
#define                                 INT3IF_bit          _BIT_ACCESS(PIR0,3)
// IPR0<INT3IP>
extern volatile __bit                   INT3IP              __at(0x70FB);	// @ (0xE1F * 8 + 3)
#define                                 INT3IP_bit          _BIT_ACCESS(IPR0,3)
// INT3PPS<INT3PPS0>
extern volatile __bit                   INT3PPS0            __at(0x6F98);	// @ (0xDF3 * 8 + 0)
#define                                 INT3PPS0_bit        _BIT_ACCESS(INT3PPS,0)
// INT3PPS<INT3PPS1>
extern volatile __bit                   INT3PPS1            __at(0x6F99);	// @ (0xDF3 * 8 + 1)
#define                                 INT3PPS1_bit        _BIT_ACCESS(INT3PPS,1)
// INT3PPS<INT3PPS2>
extern volatile __bit                   INT3PPS2            __at(0x6F9A);	// @ (0xDF3 * 8 + 2)
#define                                 INT3PPS2_bit        _BIT_ACCESS(INT3PPS,2)
// INT3PPS<INT3PPS3>
extern volatile __bit                   INT3PPS3            __at(0x6F9B);	// @ (0xDF3 * 8 + 3)
#define                                 INT3PPS3_bit        _BIT_ACCESS(INT3PPS,3)
// INT3PPS<INT3PPS4>
extern volatile __bit                   INT3PPS4            __at(0x6F9C);	// @ (0xDF3 * 8 + 4)
#define                                 INT3PPS4_bit        _BIT_ACCESS(INT3PPS,4)
// INT3PPS<INT3PPS5>
extern volatile __bit                   INT3PPS5            __at(0x6F9D);	// @ (0xDF3 * 8 + 5)
#define                                 INT3PPS5_bit        _BIT_ACCESS(INT3PPS,5)
// HLVDCON0<INTH>
extern volatile __bit                   INTH                __at(0x7611);	// @ (0xEC2 * 8 + 1)
#define                                 INTH_bit            _BIT_ACCESS(HLVDCON0,1)
// HLVDCON0<INTL>
extern volatile __bit                   INTL                __at(0x7610);	// @ (0xEC2 * 8 + 0)
#define                                 INTL_bit            _BIT_ACCESS(HLVDCON0,0)
// SCANCON0<INTM>
extern volatile __bit                   INTM                __at(0x7A7B);	// @ (0xF4F * 8 + 3)
#define                                 INTM_bit            _BIT_ACCESS(SCANCON0,3)
// SCANCON0<INVALID>
extern volatile __bit                   INVALID             __at(0x7A7C);	// @ (0xF4F * 8 + 4)
#define                                 INVALID_bit         _BIT_ACCESS(SCANCON0,4)
// IOCBF<IOCBF0>
extern volatile __bit                   IOCBF0              __at(0x7498);	// @ (0xE93 * 8 + 0)
#define                                 IOCBF0_bit          _BIT_ACCESS(IOCBF,0)
// IOCBF<IOCBF1>
extern volatile __bit                   IOCBF1              __at(0x7499);	// @ (0xE93 * 8 + 1)
#define                                 IOCBF1_bit          _BIT_ACCESS(IOCBF,1)
// IOCBF<IOCBF2>
extern volatile __bit                   IOCBF2              __at(0x749A);	// @ (0xE93 * 8 + 2)
#define                                 IOCBF2_bit          _BIT_ACCESS(IOCBF,2)
// IOCBF<IOCBF3>
extern volatile __bit                   IOCBF3              __at(0x749B);	// @ (0xE93 * 8 + 3)
#define                                 IOCBF3_bit          _BIT_ACCESS(IOCBF,3)
// IOCBF<IOCBF4>
extern volatile __bit                   IOCBF4              __at(0x749C);	// @ (0xE93 * 8 + 4)
#define                                 IOCBF4_bit          _BIT_ACCESS(IOCBF,4)
// IOCBF<IOCBF5>
extern volatile __bit                   IOCBF5              __at(0x749D);	// @ (0xE93 * 8 + 5)
#define                                 IOCBF5_bit          _BIT_ACCESS(IOCBF,5)
// IOCBF<IOCBF6>
extern volatile __bit                   IOCBF6              __at(0x749E);	// @ (0xE93 * 8 + 6)
#define                                 IOCBF6_bit          _BIT_ACCESS(IOCBF,6)
// IOCBF<IOCBF7>
extern volatile __bit                   IOCBF7              __at(0x749F);	// @ (0xE93 * 8 + 7)
#define                                 IOCBF7_bit          _BIT_ACCESS(IOCBF,7)
// IOCBN<IOCBN0>
extern volatile __bit                   IOCBN0              __at(0x74A0);	// @ (0xE94 * 8 + 0)
#define                                 IOCBN0_bit          _BIT_ACCESS(IOCBN,0)
// IOCBN<IOCBN1>
extern volatile __bit                   IOCBN1              __at(0x74A1);	// @ (0xE94 * 8 + 1)
#define                                 IOCBN1_bit          _BIT_ACCESS(IOCBN,1)
// IOCBN<IOCBN2>
extern volatile __bit                   IOCBN2              __at(0x74A2);	// @ (0xE94 * 8 + 2)
#define                                 IOCBN2_bit          _BIT_ACCESS(IOCBN,2)
// IOCBN<IOCBN3>
extern volatile __bit                   IOCBN3              __at(0x74A3);	// @ (0xE94 * 8 + 3)
#define                                 IOCBN3_bit          _BIT_ACCESS(IOCBN,3)
// IOCBN<IOCBN4>
extern volatile __bit                   IOCBN4              __at(0x74A4);	// @ (0xE94 * 8 + 4)
#define                                 IOCBN4_bit          _BIT_ACCESS(IOCBN,4)
// IOCBN<IOCBN5>
extern volatile __bit                   IOCBN5              __at(0x74A5);	// @ (0xE94 * 8 + 5)
#define                                 IOCBN5_bit          _BIT_ACCESS(IOCBN,5)
// IOCBN<IOCBN6>
extern volatile __bit                   IOCBN6              __at(0x74A6);	// @ (0xE94 * 8 + 6)
#define                                 IOCBN6_bit          _BIT_ACCESS(IOCBN,6)
// IOCBN<IOCBN7>
extern volatile __bit                   IOCBN7              __at(0x74A7);	// @ (0xE94 * 8 + 7)
#define                                 IOCBN7_bit          _BIT_ACCESS(IOCBN,7)
// IOCBP<IOCBP0>
extern volatile __bit                   IOCBP0              __at(0x74A8);	// @ (0xE95 * 8 + 0)
#define                                 IOCBP0_bit          _BIT_ACCESS(IOCBP,0)
// IOCBP<IOCBP1>
extern volatile __bit                   IOCBP1              __at(0x74A9);	// @ (0xE95 * 8 + 1)
#define                                 IOCBP1_bit          _BIT_ACCESS(IOCBP,1)
// IOCBP<IOCBP2>
extern volatile __bit                   IOCBP2              __at(0x74AA);	// @ (0xE95 * 8 + 2)
#define                                 IOCBP2_bit          _BIT_ACCESS(IOCBP,2)
// IOCBP<IOCBP3>
extern volatile __bit                   IOCBP3              __at(0x74AB);	// @ (0xE95 * 8 + 3)
#define                                 IOCBP3_bit          _BIT_ACCESS(IOCBP,3)
// IOCBP<IOCBP4>
extern volatile __bit                   IOCBP4              __at(0x74AC);	// @ (0xE95 * 8 + 4)
#define                                 IOCBP4_bit          _BIT_ACCESS(IOCBP,4)
// IOCBP<IOCBP5>
extern volatile __bit                   IOCBP5              __at(0x74AD);	// @ (0xE95 * 8 + 5)
#define                                 IOCBP5_bit          _BIT_ACCESS(IOCBP,5)
// IOCBP<IOCBP6>
extern volatile __bit                   IOCBP6              __at(0x74AE);	// @ (0xE95 * 8 + 6)
#define                                 IOCBP6_bit          _BIT_ACCESS(IOCBP,6)
// IOCBP<IOCBP7>
extern volatile __bit                   IOCBP7              __at(0x74AF);	// @ (0xE95 * 8 + 7)
#define                                 IOCBP7_bit          _BIT_ACCESS(IOCBP,7)
// IOCCF<IOCCF0>
extern volatile __bit                   IOCCF0              __at(0x74D8);	// @ (0xE9B * 8 + 0)
#define                                 IOCCF0_bit          _BIT_ACCESS(IOCCF,0)
// IOCCF<IOCCF1>
extern volatile __bit                   IOCCF1              __at(0x74D9);	// @ (0xE9B * 8 + 1)
#define                                 IOCCF1_bit          _BIT_ACCESS(IOCCF,1)
// IOCCF<IOCCF2>
extern volatile __bit                   IOCCF2              __at(0x74DA);	// @ (0xE9B * 8 + 2)
#define                                 IOCCF2_bit          _BIT_ACCESS(IOCCF,2)
// IOCCF<IOCCF3>
extern volatile __bit                   IOCCF3              __at(0x74DB);	// @ (0xE9B * 8 + 3)
#define                                 IOCCF3_bit          _BIT_ACCESS(IOCCF,3)
// IOCCF<IOCCF4>
extern volatile __bit                   IOCCF4              __at(0x74DC);	// @ (0xE9B * 8 + 4)
#define                                 IOCCF4_bit          _BIT_ACCESS(IOCCF,4)
// IOCCF<IOCCF5>
extern volatile __bit                   IOCCF5              __at(0x74DD);	// @ (0xE9B * 8 + 5)
#define                                 IOCCF5_bit          _BIT_ACCESS(IOCCF,5)
// IOCCF<IOCCF6>
extern volatile __bit                   IOCCF6              __at(0x74DE);	// @ (0xE9B * 8 + 6)
#define                                 IOCCF6_bit          _BIT_ACCESS(IOCCF,6)
// IOCCF<IOCCF7>
extern volatile __bit                   IOCCF7              __at(0x74DF);	// @ (0xE9B * 8 + 7)
#define                                 IOCCF7_bit          _BIT_ACCESS(IOCCF,7)
// IOCCN<IOCCN0>
extern volatile __bit                   IOCCN0              __at(0x74E0);	// @ (0xE9C * 8 + 0)
#define                                 IOCCN0_bit          _BIT_ACCESS(IOCCN,0)
// IOCCN<IOCCN1>
extern volatile __bit                   IOCCN1              __at(0x74E1);	// @ (0xE9C * 8 + 1)
#define                                 IOCCN1_bit          _BIT_ACCESS(IOCCN,1)
// IOCCN<IOCCN2>
extern volatile __bit                   IOCCN2              __at(0x74E2);	// @ (0xE9C * 8 + 2)
#define                                 IOCCN2_bit          _BIT_ACCESS(IOCCN,2)
// IOCCN<IOCCN3>
extern volatile __bit                   IOCCN3              __at(0x74E3);	// @ (0xE9C * 8 + 3)
#define                                 IOCCN3_bit          _BIT_ACCESS(IOCCN,3)
// IOCCN<IOCCN4>
extern volatile __bit                   IOCCN4              __at(0x74E4);	// @ (0xE9C * 8 + 4)
#define                                 IOCCN4_bit          _BIT_ACCESS(IOCCN,4)
// IOCCN<IOCCN5>
extern volatile __bit                   IOCCN5              __at(0x74E5);	// @ (0xE9C * 8 + 5)
#define                                 IOCCN5_bit          _BIT_ACCESS(IOCCN,5)
// IOCCN<IOCCN6>
extern volatile __bit                   IOCCN6              __at(0x74E6);	// @ (0xE9C * 8 + 6)
#define                                 IOCCN6_bit          _BIT_ACCESS(IOCCN,6)
// IOCCN<IOCCN7>
extern volatile __bit                   IOCCN7              __at(0x74E7);	// @ (0xE9C * 8 + 7)
#define                                 IOCCN7_bit          _BIT_ACCESS(IOCCN,7)
// IOCCP<IOCCP0>
extern volatile __bit                   IOCCP0              __at(0x74E8);	// @ (0xE9D * 8 + 0)
#define                                 IOCCP0_bit          _BIT_ACCESS(IOCCP,0)
// IOCCP<IOCCP1>
extern volatile __bit                   IOCCP1              __at(0x74E9);	// @ (0xE9D * 8 + 1)
#define                                 IOCCP1_bit          _BIT_ACCESS(IOCCP,1)
// IOCCP<IOCCP2>
extern volatile __bit                   IOCCP2              __at(0x74EA);	// @ (0xE9D * 8 + 2)
#define                                 IOCCP2_bit          _BIT_ACCESS(IOCCP,2)
// IOCCP<IOCCP3>
extern volatile __bit                   IOCCP3              __at(0x74EB);	// @ (0xE9D * 8 + 3)
#define                                 IOCCP3_bit          _BIT_ACCESS(IOCCP,3)
// IOCCP<IOCCP4>
extern volatile __bit                   IOCCP4              __at(0x74EC);	// @ (0xE9D * 8 + 4)
#define                                 IOCCP4_bit          _BIT_ACCESS(IOCCP,4)
// IOCCP<IOCCP5>
extern volatile __bit                   IOCCP5              __at(0x74ED);	// @ (0xE9D * 8 + 5)
#define                                 IOCCP5_bit          _BIT_ACCESS(IOCCP,5)
// IOCCP<IOCCP6>
extern volatile __bit                   IOCCP6              __at(0x74EE);	// @ (0xE9D * 8 + 6)
#define                                 IOCCP6_bit          _BIT_ACCESS(IOCCP,6)
// IOCCP<IOCCP7>
extern volatile __bit                   IOCCP7              __at(0x74EF);	// @ (0xE9D * 8 + 7)
#define                                 IOCCP7_bit          _BIT_ACCESS(IOCCP,7)
// IOCEF<IOCEF0>
