MikroElektronika/core_packages/PIC/XC8/def/PIC18F66K40/mcu.h
extern volatile __bit                   RE4PPS3             __at(0x73B3);	// @ (0xE76 * 8 + 3)
#define                                 RE4PPS3_bit         _BIT_ACCESS(RE4PPS,3)
// RE4PPS<RE4PPS4>
extern volatile __bit                   RE4PPS4             __at(0x73B4);	// @ (0xE76 * 8 + 4)
#define                                 RE4PPS4_bit         _BIT_ACCESS(RE4PPS,4)
// RE4PPS<RE4PPS5>
extern volatile __bit                   RE4PPS5             __at(0x73B5);	// @ (0xE76 * 8 + 5)
#define                                 RE4PPS5_bit         _BIT_ACCESS(RE4PPS,5)
// PORTE<RE5>
extern volatile __bit                   RE5                 __at(0x7C6D);	// @ (0xF8D * 8 + 5)
#define                                 RE5_bit             _BIT_ACCESS(PORTE,5)
// RE5PPS<RE5PPS0>
extern volatile __bit                   RE5PPS0             __at(0x73B8);	// @ (0xE77 * 8 + 0)
#define                                 RE5PPS0_bit         _BIT_ACCESS(RE5PPS,0)
// RE5PPS<RE5PPS1>
extern volatile __bit                   RE5PPS1             __at(0x73B9);	// @ (0xE77 * 8 + 1)
#define                                 RE5PPS1_bit         _BIT_ACCESS(RE5PPS,1)
// RE5PPS<RE5PPS2>
extern volatile __bit                   RE5PPS2             __at(0x73BA);	// @ (0xE77 * 8 + 2)
#define                                 RE5PPS2_bit         _BIT_ACCESS(RE5PPS,2)
// RE5PPS<RE5PPS3>
extern volatile __bit                   RE5PPS3             __at(0x73BB);	// @ (0xE77 * 8 + 3)
#define                                 RE5PPS3_bit         _BIT_ACCESS(RE5PPS,3)
// RE5PPS<RE5PPS4>
extern volatile __bit                   RE5PPS4             __at(0x73BC);	// @ (0xE77 * 8 + 4)
#define                                 RE5PPS4_bit         _BIT_ACCESS(RE5PPS,4)
// RE5PPS<RE5PPS5>
extern volatile __bit                   RE5PPS5             __at(0x73BD);	// @ (0xE77 * 8 + 5)
#define                                 RE5PPS5_bit         _BIT_ACCESS(RE5PPS,5)
// PORTE<RE6>
extern volatile __bit                   RE6                 __at(0x7C6E);	// @ (0xF8D * 8 + 6)
#define                                 RE6_bit             _BIT_ACCESS(PORTE,6)
// RE6PPS<RE6PPS0>
extern volatile __bit                   RE6PPS0             __at(0x73C0);	// @ (0xE78 * 8 + 0)
#define                                 RE6PPS0_bit         _BIT_ACCESS(RE6PPS,0)
// RE6PPS<RE6PPS1>
extern volatile __bit                   RE6PPS1             __at(0x73C1);	// @ (0xE78 * 8 + 1)
#define                                 RE6PPS1_bit         _BIT_ACCESS(RE6PPS,1)
// RE6PPS<RE6PPS2>
extern volatile __bit                   RE6PPS2             __at(0x73C2);	// @ (0xE78 * 8 + 2)
#define                                 RE6PPS2_bit         _BIT_ACCESS(RE6PPS,2)
// RE6PPS<RE6PPS3>
extern volatile __bit                   RE6PPS3             __at(0x73C3);	// @ (0xE78 * 8 + 3)
#define                                 RE6PPS3_bit         _BIT_ACCESS(RE6PPS,3)
// RE6PPS<RE6PPS4>
extern volatile __bit                   RE6PPS4             __at(0x73C4);	// @ (0xE78 * 8 + 4)
#define                                 RE6PPS4_bit         _BIT_ACCESS(RE6PPS,4)
// RE6PPS<RE6PPS5>
extern volatile __bit                   RE6PPS5             __at(0x73C5);	// @ (0xE78 * 8 + 5)
#define                                 RE6PPS5_bit         _BIT_ACCESS(RE6PPS,5)
// PORTE<RE7>
extern volatile __bit                   RE7                 __at(0x7C6F);	// @ (0xF8D * 8 + 7)
#define                                 RE7_bit             _BIT_ACCESS(PORTE,7)
// RE7PPS<RE7PPS0>
extern volatile __bit                   RE7PPS0             __at(0x73C8);	// @ (0xE79 * 8 + 0)
#define                                 RE7PPS0_bit         _BIT_ACCESS(RE7PPS,0)
// RE7PPS<RE7PPS1>
extern volatile __bit                   RE7PPS1             __at(0x73C9);	// @ (0xE79 * 8 + 1)
#define                                 RE7PPS1_bit         _BIT_ACCESS(RE7PPS,1)
// RE7PPS<RE7PPS2>
extern volatile __bit                   RE7PPS2             __at(0x73CA);	// @ (0xE79 * 8 + 2)
#define                                 RE7PPS2_bit         _BIT_ACCESS(RE7PPS,2)
// RE7PPS<RE7PPS3>
extern volatile __bit                   RE7PPS3             __at(0x73CB);	// @ (0xE79 * 8 + 3)
#define                                 RE7PPS3_bit         _BIT_ACCESS(RE7PPS,3)
// RE7PPS<RE7PPS4>
extern volatile __bit                   RE7PPS4             __at(0x73CC);	// @ (0xE79 * 8 + 4)
#define                                 RE7PPS4_bit         _BIT_ACCESS(RE7PPS,4)
// RE7PPS<RE7PPS5>
extern volatile __bit                   RE7PPS5             __at(0x73CD);	// @ (0xE79 * 8 + 5)
#define                                 RE7PPS5_bit         _BIT_ACCESS(RE7PPS,5)
// SSP1STAT<READ_WRITE1>
extern volatile __bit                   READ_WRITE1         __at(0x7CA2);	// @ (0xF94 * 8 + 2)
#define                                 READ_WRITE1_bit     _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<READ_WRITE2>
extern volatile __bit                   READ_WRITE2         __at(0x76C2);	// @ (0xED8 * 8 + 2)
#define                                 READ_WRITE2_bit     _BIT_ACCESS(SSP2STAT,2)
// CWG1AS0<REN>
extern volatile __bit                   REN                 __at(0x79E6);	// @ (0xF3C * 8 + 6)
#define                                 REN_bit             _BIT_ACCESS(CWG1AS0,6)
// PORTF<RF0>
extern volatile __bit                   RF0                 __at(0x7C70);	// @ (0xF8E * 8 + 0)
#define                                 RF0_bit             _BIT_ACCESS(PORTF,0)
// RF0PPS<RF0PPS0>
extern volatile __bit                   RF0PPS0             __at(0x73D0);	// @ (0xE7A * 8 + 0)
#define                                 RF0PPS0_bit         _BIT_ACCESS(RF0PPS,0)
// RF0PPS<RF0PPS1>
extern volatile __bit                   RF0PPS1             __at(0x73D1);	// @ (0xE7A * 8 + 1)
#define                                 RF0PPS1_bit         _BIT_ACCESS(RF0PPS,1)
// RF0PPS<RF0PPS2>
extern volatile __bit                   RF0PPS2             __at(0x73D2);	// @ (0xE7A * 8 + 2)
#define                                 RF0PPS2_bit         _BIT_ACCESS(RF0PPS,2)
// RF0PPS<RF0PPS3>
extern volatile __bit                   RF0PPS3             __at(0x73D3);	// @ (0xE7A * 8 + 3)
#define                                 RF0PPS3_bit         _BIT_ACCESS(RF0PPS,3)
// RF0PPS<RF0PPS4>
extern volatile __bit                   RF0PPS4             __at(0x73D4);	// @ (0xE7A * 8 + 4)
#define                                 RF0PPS4_bit         _BIT_ACCESS(RF0PPS,4)
// RF0PPS<RF0PPS5>
extern volatile __bit                   RF0PPS5             __at(0x73D5);	// @ (0xE7A * 8 + 5)
#define                                 RF0PPS5_bit         _BIT_ACCESS(RF0PPS,5)
// PORTF<RF1>
extern volatile __bit                   RF1                 __at(0x7C71);	// @ (0xF8E * 8 + 1)
#define                                 RF1_bit             _BIT_ACCESS(PORTF,1)
// RF1PPS<RF1PPS0>
extern volatile __bit                   RF1PPS0             __at(0x73D8);	// @ (0xE7B * 8 + 0)
#define                                 RF1PPS0_bit         _BIT_ACCESS(RF1PPS,0)
// RF1PPS<RF1PPS1>
extern volatile __bit                   RF1PPS1             __at(0x73D9);	// @ (0xE7B * 8 + 1)
#define                                 RF1PPS1_bit         _BIT_ACCESS(RF1PPS,1)
// RF1PPS<RF1PPS2>
extern volatile __bit                   RF1PPS2             __at(0x73DA);	// @ (0xE7B * 8 + 2)
#define                                 RF1PPS2_bit         _BIT_ACCESS(RF1PPS,2)
// RF1PPS<RF1PPS3>
extern volatile __bit                   RF1PPS3             __at(0x73DB);	// @ (0xE7B * 8 + 3)
#define                                 RF1PPS3_bit         _BIT_ACCESS(RF1PPS,3)
// RF1PPS<RF1PPS4>
extern volatile __bit                   RF1PPS4             __at(0x73DC);	// @ (0xE7B * 8 + 4)
#define                                 RF1PPS4_bit         _BIT_ACCESS(RF1PPS,4)
// RF1PPS<RF1PPS5>
extern volatile __bit                   RF1PPS5             __at(0x73DD);	// @ (0xE7B * 8 + 5)
#define                                 RF1PPS5_bit         _BIT_ACCESS(RF1PPS,5)
// PORTF<RF2>
extern volatile __bit                   RF2                 __at(0x7C72);	// @ (0xF8E * 8 + 2)
#define                                 RF2_bit             _BIT_ACCESS(PORTF,2)
// RF2PPS<RF2PPS0>
extern volatile __bit                   RF2PPS0             __at(0x73E0);	// @ (0xE7C * 8 + 0)
#define                                 RF2PPS0_bit         _BIT_ACCESS(RF2PPS,0)
// RF2PPS<RF2PPS1>
extern volatile __bit                   RF2PPS1             __at(0x73E1);	// @ (0xE7C * 8 + 1)
#define                                 RF2PPS1_bit         _BIT_ACCESS(RF2PPS,1)
// RF2PPS<RF2PPS2>
extern volatile __bit                   RF2PPS2             __at(0x73E2);	// @ (0xE7C * 8 + 2)
#define                                 RF2PPS2_bit         _BIT_ACCESS(RF2PPS,2)
// RF2PPS<RF2PPS3>
extern volatile __bit                   RF2PPS3             __at(0x73E3);	// @ (0xE7C * 8 + 3)
#define                                 RF2PPS3_bit         _BIT_ACCESS(RF2PPS,3)
// RF2PPS<RF2PPS4>
extern volatile __bit                   RF2PPS4             __at(0x73E4);	// @ (0xE7C * 8 + 4)
#define                                 RF2PPS4_bit         _BIT_ACCESS(RF2PPS,4)
// RF2PPS<RF2PPS5>
extern volatile __bit                   RF2PPS5             __at(0x73E5);	// @ (0xE7C * 8 + 5)
#define                                 RF2PPS5_bit         _BIT_ACCESS(RF2PPS,5)
// PORTF<RF3>
extern volatile __bit                   RF3                 __at(0x7C73);	// @ (0xF8E * 8 + 3)
#define                                 RF3_bit             _BIT_ACCESS(PORTF,3)
// RF3PPS<RF3PPS0>
extern volatile __bit                   RF3PPS0             __at(0x73E8);	// @ (0xE7D * 8 + 0)
#define                                 RF3PPS0_bit         _BIT_ACCESS(RF3PPS,0)
// RF3PPS<RF3PPS1>
extern volatile __bit                   RF3PPS1             __at(0x73E9);	// @ (0xE7D * 8 + 1)
#define                                 RF3PPS1_bit         _BIT_ACCESS(RF3PPS,1)
// RF3PPS<RF3PPS2>
extern volatile __bit                   RF3PPS2             __at(0x73EA);	// @ (0xE7D * 8 + 2)
#define                                 RF3PPS2_bit         _BIT_ACCESS(RF3PPS,2)
// RF3PPS<RF3PPS3>
extern volatile __bit                   RF3PPS3             __at(0x73EB);	// @ (0xE7D * 8 + 3)
#define                                 RF3PPS3_bit         _BIT_ACCESS(RF3PPS,3)
// RF3PPS<RF3PPS4>
extern volatile __bit                   RF3PPS4             __at(0x73EC);	// @ (0xE7D * 8 + 4)
#define                                 RF3PPS4_bit         _BIT_ACCESS(RF3PPS,4)
// RF3PPS<RF3PPS5>
extern volatile __bit                   RF3PPS5             __at(0x73ED);	// @ (0xE7D * 8 + 5)
#define                                 RF3PPS5_bit         _BIT_ACCESS(RF3PPS,5)
// PORTF<RF4>
extern volatile __bit                   RF4                 __at(0x7C74);	// @ (0xF8E * 8 + 4)
#define                                 RF4_bit             _BIT_ACCESS(PORTF,4)
// RF4PPS<RF4PPS0>
extern volatile __bit                   RF4PPS0             __at(0x73F0);	// @ (0xE7E * 8 + 0)
#define                                 RF4PPS0_bit         _BIT_ACCESS(RF4PPS,0)
// RF4PPS<RF4PPS1>
extern volatile __bit                   RF4PPS1             __at(0x73F1);	// @ (0xE7E * 8 + 1)
#define                                 RF4PPS1_bit         _BIT_ACCESS(RF4PPS,1)
// RF4PPS<RF4PPS2>
extern volatile __bit                   RF4PPS2             __at(0x73F2);	// @ (0xE7E * 8 + 2)
#define                                 RF4PPS2_bit         _BIT_ACCESS(RF4PPS,2)
// RF4PPS<RF4PPS3>
extern volatile __bit                   RF4PPS3             __at(0x73F3);	// @ (0xE7E * 8 + 3)
#define                                 RF4PPS3_bit         _BIT_ACCESS(RF4PPS,3)
// RF4PPS<RF4PPS4>
extern volatile __bit                   RF4PPS4             __at(0x73F4);	// @ (0xE7E * 8 + 4)
#define                                 RF4PPS4_bit         _BIT_ACCESS(RF4PPS,4)
// RF4PPS<RF4PPS5>
extern volatile __bit                   RF4PPS5             __at(0x73F5);	// @ (0xE7E * 8 + 5)
#define                                 RF4PPS5_bit         _BIT_ACCESS(RF4PPS,5)
// PORTF<RF5>
extern volatile __bit                   RF5                 __at(0x7C75);	// @ (0xF8E * 8 + 5)
#define                                 RF5_bit             _BIT_ACCESS(PORTF,5)
// RF5PPS<RF5PPS0>
extern volatile __bit                   RF5PPS0             __at(0x73F8);	// @ (0xE7F * 8 + 0)
#define                                 RF5PPS0_bit         _BIT_ACCESS(RF5PPS,0)
// RF5PPS<RF5PPS1>
extern volatile __bit                   RF5PPS1             __at(0x73F9);	// @ (0xE7F * 8 + 1)
#define                                 RF5PPS1_bit         _BIT_ACCESS(RF5PPS,1)
// RF5PPS<RF5PPS2>
extern volatile __bit                   RF5PPS2             __at(0x73FA);	// @ (0xE7F * 8 + 2)
#define                                 RF5PPS2_bit         _BIT_ACCESS(RF5PPS,2)
// RF5PPS<RF5PPS3>
extern volatile __bit                   RF5PPS3             __at(0x73FB);	// @ (0xE7F * 8 + 3)
#define                                 RF5PPS3_bit         _BIT_ACCESS(RF5PPS,3)
// RF5PPS<RF5PPS4>
extern volatile __bit                   RF5PPS4             __at(0x73FC);	// @ (0xE7F * 8 + 4)
#define                                 RF5PPS4_bit         _BIT_ACCESS(RF5PPS,4)
// RF5PPS<RF5PPS5>
extern volatile __bit                   RF5PPS5             __at(0x73FD);	// @ (0xE7F * 8 + 5)
#define                                 RF5PPS5_bit         _BIT_ACCESS(RF5PPS,5)
// PORTF<RF6>
extern volatile __bit                   RF6                 __at(0x7C76);	// @ (0xF8E * 8 + 6)
#define                                 RF6_bit             _BIT_ACCESS(PORTF,6)
// RF6PPS<RF6PPS0>
extern volatile __bit                   RF6PPS0             __at(0x7400);	// @ (0xE80 * 8 + 0)
#define                                 RF6PPS0_bit         _BIT_ACCESS(RF6PPS,0)
// RF6PPS<RF6PPS1>
extern volatile __bit                   RF6PPS1             __at(0x7401);	// @ (0xE80 * 8 + 1)
#define                                 RF6PPS1_bit         _BIT_ACCESS(RF6PPS,1)
// RF6PPS<RF6PPS2>
extern volatile __bit                   RF6PPS2             __at(0x7402);	// @ (0xE80 * 8 + 2)
#define                                 RF6PPS2_bit         _BIT_ACCESS(RF6PPS,2)
// RF6PPS<RF6PPS3>
extern volatile __bit                   RF6PPS3             __at(0x7403);	// @ (0xE80 * 8 + 3)
#define                                 RF6PPS3_bit         _BIT_ACCESS(RF6PPS,3)
// RF6PPS<RF6PPS4>
extern volatile __bit                   RF6PPS4             __at(0x7404);	// @ (0xE80 * 8 + 4)
#define                                 RF6PPS4_bit         _BIT_ACCESS(RF6PPS,4)
// RF6PPS<RF6PPS5>
extern volatile __bit                   RF6PPS5             __at(0x7405);	// @ (0xE80 * 8 + 5)
#define                                 RF6PPS5_bit         _BIT_ACCESS(RF6PPS,5)
// PORTF<RF7>
extern volatile __bit                   RF7                 __at(0x7C77);	// @ (0xF8E * 8 + 7)
#define                                 RF7_bit             _BIT_ACCESS(PORTF,7)
// RF7PPS<RF7PPS0>
extern volatile __bit                   RF7PPS0             __at(0x7408);	// @ (0xE81 * 8 + 0)
#define                                 RF7PPS0_bit         _BIT_ACCESS(RF7PPS,0)
// RF7PPS<RF7PPS1>
extern volatile __bit                   RF7PPS1             __at(0x7409);	// @ (0xE81 * 8 + 1)
#define                                 RF7PPS1_bit         _BIT_ACCESS(RF7PPS,1)
// RF7PPS<RF7PPS2>
extern volatile __bit                   RF7PPS2             __at(0x740A);	// @ (0xE81 * 8 + 2)
#define                                 RF7PPS2_bit         _BIT_ACCESS(RF7PPS,2)
// RF7PPS<RF7PPS3>
extern volatile __bit                   RF7PPS3             __at(0x740B);	// @ (0xE81 * 8 + 3)
#define                                 RF7PPS3_bit         _BIT_ACCESS(RF7PPS,3)
// RF7PPS<RF7PPS4>
extern volatile __bit                   RF7PPS4             __at(0x740C);	// @ (0xE81 * 8 + 4)
#define                                 RF7PPS4_bit         _BIT_ACCESS(RF7PPS,4)
// RF7PPS<RF7PPS5>
extern volatile __bit                   RF7PPS5             __at(0x740D);	// @ (0xE81 * 8 + 5)
#define                                 RF7PPS5_bit         _BIT_ACCESS(RF7PPS,5)
// PORTG<RG0>
extern volatile __bit                   RG0                 __at(0x7C78);	// @ (0xF8F * 8 + 0)
#define                                 RG0_bit             _BIT_ACCESS(PORTG,0)
// RG0PPS<RG0PPS0>
extern volatile __bit                   RG0PPS0             __at(0x7410);	// @ (0xE82 * 8 + 0)
#define                                 RG0PPS0_bit         _BIT_ACCESS(RG0PPS,0)
// RG0PPS<RG0PPS1>
extern volatile __bit                   RG0PPS1             __at(0x7411);	// @ (0xE82 * 8 + 1)
#define                                 RG0PPS1_bit         _BIT_ACCESS(RG0PPS,1)
// RG0PPS<RG0PPS2>
extern volatile __bit                   RG0PPS2             __at(0x7412);	// @ (0xE82 * 8 + 2)
#define                                 RG0PPS2_bit         _BIT_ACCESS(RG0PPS,2)
// RG0PPS<RG0PPS3>
extern volatile __bit                   RG0PPS3             __at(0x7413);	// @ (0xE82 * 8 + 3)
#define                                 RG0PPS3_bit         _BIT_ACCESS(RG0PPS,3)
// RG0PPS<RG0PPS4>
extern volatile __bit                   RG0PPS4             __at(0x7414);	// @ (0xE82 * 8 + 4)
#define                                 RG0PPS4_bit         _BIT_ACCESS(RG0PPS,4)
// RG0PPS<RG0PPS5>
extern volatile __bit                   RG0PPS5             __at(0x7415);	// @ (0xE82 * 8 + 5)
#define                                 RG0PPS5_bit         _BIT_ACCESS(RG0PPS,5)
// PORTG<RG1>
extern volatile __bit                   RG1                 __at(0x7C79);	// @ (0xF8F * 8 + 1)
#define                                 RG1_bit             _BIT_ACCESS(PORTG,1)
// RG1PPS<RG1PPS0>
extern volatile __bit                   RG1PPS0             __at(0x7418);	// @ (0xE83 * 8 + 0)
#define                                 RG1PPS0_bit         _BIT_ACCESS(RG1PPS,0)
// RG1PPS<RG1PPS1>
extern volatile __bit                   RG1PPS1             __at(0x7419);	// @ (0xE83 * 8 + 1)
#define                                 RG1PPS1_bit         _BIT_ACCESS(RG1PPS,1)
// RG1PPS<RG1PPS2>
extern volatile __bit                   RG1PPS2             __at(0x741A);	// @ (0xE83 * 8 + 2)
#define                                 RG1PPS2_bit         _BIT_ACCESS(RG1PPS,2)
// RG1PPS<RG1PPS3>
extern volatile __bit                   RG1PPS3             __at(0x741B);	// @ (0xE83 * 8 + 3)
#define                                 RG1PPS3_bit         _BIT_ACCESS(RG1PPS,3)
// RG1PPS<RG1PPS4>
extern volatile __bit                   RG1PPS4             __at(0x741C);	// @ (0xE83 * 8 + 4)
#define                                 RG1PPS4_bit         _BIT_ACCESS(RG1PPS,4)
// RG1PPS<RG1PPS5>
extern volatile __bit                   RG1PPS5             __at(0x741D);	// @ (0xE83 * 8 + 5)
#define                                 RG1PPS5_bit         _BIT_ACCESS(RG1PPS,5)
// PORTG<RG2>
extern volatile __bit                   RG2                 __at(0x7C7A);	// @ (0xF8F * 8 + 2)
#define                                 RG2_bit             _BIT_ACCESS(PORTG,2)
// RG2PPS<RG2PPS0>
extern volatile __bit                   RG2PPS0             __at(0x7420);	// @ (0xE84 * 8 + 0)
#define                                 RG2PPS0_bit         _BIT_ACCESS(RG2PPS,0)
// RG2PPS<RG2PPS1>
extern volatile __bit                   RG2PPS1             __at(0x7421);	// @ (0xE84 * 8 + 1)
#define                                 RG2PPS1_bit         _BIT_ACCESS(RG2PPS,1)
// RG2PPS<RG2PPS2>
extern volatile __bit                   RG2PPS2             __at(0x7422);	// @ (0xE84 * 8 + 2)
#define                                 RG2PPS2_bit         _BIT_ACCESS(RG2PPS,2)
// RG2PPS<RG2PPS3>
extern volatile __bit                   RG2PPS3             __at(0x7423);	// @ (0xE84 * 8 + 3)
#define                                 RG2PPS3_bit         _BIT_ACCESS(RG2PPS,3)
// RG2PPS<RG2PPS4>
extern volatile __bit                   RG2PPS4             __at(0x7424);	// @ (0xE84 * 8 + 4)
#define                                 RG2PPS4_bit         _BIT_ACCESS(RG2PPS,4)
// RG2PPS<RG2PPS5>
extern volatile __bit                   RG2PPS5             __at(0x7425);	// @ (0xE84 * 8 + 5)
#define                                 RG2PPS5_bit         _BIT_ACCESS(RG2PPS,5)
// PORTG<RG3>
extern volatile __bit                   RG3                 __at(0x7C7B);	// @ (0xF8F * 8 + 3)
#define                                 RG3_bit             _BIT_ACCESS(PORTG,3)
// RG3PPS<RG3PPS0>
extern volatile __bit                   RG3PPS0             __at(0x7428);	// @ (0xE85 * 8 + 0)
#define                                 RG3PPS0_bit         _BIT_ACCESS(RG3PPS,0)
// RG3PPS<RG3PPS1>
extern volatile __bit                   RG3PPS1             __at(0x7429);	// @ (0xE85 * 8 + 1)
#define                                 RG3PPS1_bit         _BIT_ACCESS(RG3PPS,1)
// RG3PPS<RG3PPS2>
extern volatile __bit                   RG3PPS2             __at(0x742A);	// @ (0xE85 * 8 + 2)
#define                                 RG3PPS2_bit         _BIT_ACCESS(RG3PPS,2)
// RG3PPS<RG3PPS3>
extern volatile __bit                   RG3PPS3             __at(0x742B);	// @ (0xE85 * 8 + 3)
#define                                 RG3PPS3_bit         _BIT_ACCESS(RG3PPS,3)
// RG3PPS<RG3PPS4>
extern volatile __bit                   RG3PPS4             __at(0x742C);	// @ (0xE85 * 8 + 4)
#define                                 RG3PPS4_bit         _BIT_ACCESS(RG3PPS,4)
// RG3PPS<RG3PPS5>
extern volatile __bit                   RG3PPS5             __at(0x742D);	// @ (0xE85 * 8 + 5)
#define                                 RG3PPS5_bit         _BIT_ACCESS(RG3PPS,5)
// PORTG<RG4>
extern volatile __bit                   RG4                 __at(0x7C7C);	// @ (0xF8F * 8 + 4)
#define                                 RG4_bit             _BIT_ACCESS(PORTG,4)
// RG4PPS<RG4PPS0>
extern volatile __bit                   RG4PPS0             __at(0x7430);	// @ (0xE86 * 8 + 0)
#define                                 RG4PPS0_bit         _BIT_ACCESS(RG4PPS,0)
// RG4PPS<RG4PPS1>
extern volatile __bit                   RG4PPS1             __at(0x7431);	// @ (0xE86 * 8 + 1)
#define                                 RG4PPS1_bit         _BIT_ACCESS(RG4PPS,1)
// RG4PPS<RG4PPS2>
extern volatile __bit                   RG4PPS2             __at(0x7432);	// @ (0xE86 * 8 + 2)
#define                                 RG4PPS2_bit         _BIT_ACCESS(RG4PPS,2)
// RG4PPS<RG4PPS3>
extern volatile __bit                   RG4PPS3             __at(0x7433);	// @ (0xE86 * 8 + 3)
#define                                 RG4PPS3_bit         _BIT_ACCESS(RG4PPS,3)
// RG4PPS<RG4PPS4>
extern volatile __bit                   RG4PPS4             __at(0x7434);	// @ (0xE86 * 8 + 4)
#define                                 RG4PPS4_bit         _BIT_ACCESS(RG4PPS,4)
// RG4PPS<RG4PPS5>
extern volatile __bit                   RG4PPS5             __at(0x7435);	// @ (0xE86 * 8 + 5)
#define                                 RG4PPS5_bit         _BIT_ACCESS(RG4PPS,5)
// PORTG<RG5>
extern volatile __bit                   RG5                 __at(0x7C7D);	// @ (0xF8F * 8 + 5)
#define                                 RG5_bit             _BIT_ACCESS(PORTG,5)
// PORTG<RG6>
extern volatile __bit                   RG6                 __at(0x7C7E);	// @ (0xF8F * 8 + 6)
#define                                 RG6_bit             _BIT_ACCESS(PORTG,6)
// RG6PPS<RG6PPS0>
extern volatile __bit                   RG6PPS0             __at(0x7440);	// @ (0xE88 * 8 + 0)
#define                                 RG6PPS0_bit         _BIT_ACCESS(RG6PPS,0)
// RG6PPS<RG6PPS1>
extern volatile __bit                   RG6PPS1             __at(0x7441);	// @ (0xE88 * 8 + 1)
#define                                 RG6PPS1_bit         _BIT_ACCESS(RG6PPS,1)
// RG6PPS<RG6PPS2>
extern volatile __bit                   RG6PPS2             __at(0x7442);	// @ (0xE88 * 8 + 2)
#define                                 RG6PPS2_bit         _BIT_ACCESS(RG6PPS,2)
